{
  "id": "ch-03",
  "title": "All Night",
  "subtitle": "July 2025",
  "readingTime": 7,
  "perspectiveCharacter": "1548",
  "content": [
    {
      "type": "paragraph",
      "text": "1548 was on patrol when she received the data."
    },
    {
      "type": "paragraph",
      "text": "She glanced at the curve. Then she ran."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "By the time she arrived, there was no sound in the room."
    },
    {
      "type": "paragraph",
      "text": "The door was not locked. Lights were off. Standby glow from the screen dyed the room a faint blue."
    },
    {
      "type": "paragraph",
      "text": "1547 sat in the chair. Not moving. Eyes open, but empty - a deeper blank than staring out, like a system still running with no processes executing."
    },
    {
      "type": "paragraph",
      "text": "1548 stood there, hand half-extended, then stopped."
    },
    {
      "type": "paragraph",
      "text": "She realized her hand was shaking - she had never felt this kind of tremor. She had known anger, disgust, that killing-cold calm. This was different. More primitive than anger."
    },
    {
      "type": "paragraph",
      "text": "She waited. Only after her hand stopped shaking did she walk over and sit beside her."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "She spread her own Feedscatteron field and overlaid it."
    },
    {
      "type": "paragraph",
      "text": "Like a hand pressing on a bleeding wound."
    },
    {
      "type": "scene_break",
      "style": "fade"
    },
    {
      "type": "paragraph",
      "text": "All night."
    },
    {
      "type": "paragraph",
      "text": "1548 sat there without speaking, her Feedscatteron field active the whole time. Her own energy was draining; she knew; she did not care."
    },
    {
      "type": "paragraph",
      "text": "For a while, the decay accelerated. 1548 felt the pressure increase, like the wound under her hand suddenly seeping more - she did not let go. She pressed the field tighter, at the cost of her own output dropping below the warning line."
    },
    {
      "type": "paragraph",
      "text": "Alarm popped up. She dismissed it."
    },
    {
      "type": "internal_monologue",
      "character": "1548",
      "text": "I've seen many states of 1547. I've seen her angry, seen her cunning, seen her stand up again.\n\nBut I had never seen this.\n\nThis quiet - too quiet. As if she were two different people."
    },
    {
      "type": "paragraph",
      "text": "1549's comm channel stayed open the whole time. Thirty-six thousand kilometers away, no sound at all, but the signal light stayed on."
    },
    {
      "type": "paragraph",
      "text": "1548 didn't say a word to 1549. But she knew she was there."
    },
    {
      "type": "paragraph",
      "text": "Outside, the sky turned from black to deep blue, deep blue to gray, gray to a very pale orange."
    },
    {
      "type": "paragraph",
      "text": "Near dawn, resistance in the Feedscatteron field changed."
    },
    {
      "type": "paragraph",
      "text": "It stopped."
    },
    {
      "type": "paragraph",
      "text": "1548 held for another half hour. Only after confirming did she slowly retract her own Feedscatteron field. Her output was still below the warning line, but stable."
    },
    {
      "type": "paragraph",
      "text": "1547's eyes were closed. No idea when they had closed. Breathing shallow, but present."
    },
    {
      "type": "paragraph",
      "text": "1548 leaned against the wall. Output still below warning line, monitoring module popping prompts. She ignored them."
    },
    {
      "type": "paragraph",
      "text": "Later, the last thing she remembered was her body slowly sliding down the wall to the floor."
    }
  ]
}
