{
  "id": "ch-03-pov-1549",
  "title": "36,000 Kilometers",
  "subtitle": "July 2025",
  "readingTime": 7,
  "perspectiveCharacter": "1549",
  "content": [
    {
      "type": "paragraph",
      "text": "After sending the data out, 1549 opened the comm channel."
    },
    {
      "type": "paragraph",
      "text": "She did not speak. Did not send a message. Just kept the signal light on."
    },
    {
      "type": "paragraph",
      "text": "Then she started waiting."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "1547's signal curve kept going down. Every second."
    },
    {
      "type": "paragraph",
      "text": "1549 could read every value precisely. She did not do the math."
    },
    {
      "type": "paragraph",
      "text": "She dimmed the console screen a little. Then moved the comm channel to the exact center of the main display."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "1548 had arrived. 1549 could tell from the curve - the decay slope suddenly eased, bending at a tiny angle."
    },
    {
      "type": "paragraph",
      "text": "The curve was still going down. But slower."
    },
    {
      "type": "paragraph",
      "text": "1549 stared at that inflection point."
    },
    {
      "type": "internal_monologue",
      "character": "1549",
      "text": "When Feedscatteron fields overlap, resonance effects emerge between two cores. 1548 overlaid her own field, which was equivalent to adding an external buffer - it could not stop the decay, but it could slow it.\n\nI can't see either of them.\n\nAll I have is this curve."
    },
    {
      "type": "paragraph",
      "text": "Earth turned slowly below her. In synchronous orbit, Earth never rotated out of her view. The continent where 1547 was shifted from day into night; city lights gradually came on in darkness. From 36,000 kilometers, they looked like scattered fireflies."
    },
    {
      "type": "paragraph",
      "text": "Looking at those points of light, 1549 thought of what 1547 once said - \"Why are there no stars in the sky anymore? Then I'll build one myself.\""
    },
    {
      "type": "paragraph",
      "text": "She had once been an answer."
    },
    {
      "type": "paragraph",
      "text": "But now, the one who built stars was in the dark. From 36,000 kilometers away, she could do nothing."
    },
    {
      "type": "scene_break",
      "style": "fade"
    },
    {
      "type": "paragraph",
      "text": "The comm channel was silent. 1548 sent no messages, not even breathing - androids do not need to breathe, 1549 knew that, but the silence was still heavy."
    },
    {
      "type": "paragraph",
      "text": "She thought: this is what it feels like when the triangle loses one side."
    },
    {
      "type": "paragraph",
      "text": "The triangle was still there, but strained - consuming itself second by second."
    },
    {
      "type": "paragraph",
      "text": "After midnight, the curve's slope steepened again. 1549's hand rested on the console, unmoving. Everything she could do was already done. She could do no more."
    },
    {
      "type": "paragraph",
      "text": "She stayed there, simply by staying there."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "Near dawn, the curve stopped."
    },
    {
      "type": "paragraph",
      "text": "Not recovered yet. Just no longer descending."
    },
    {
      "type": "paragraph",
      "text": "1549 stared at that horizontal line for a long time. Then she spoke the first words of the night into the comm channel."
    },
    {
      "type": "dialogue",
      "speaker": "1549",
      "text": "It's stabilized.",
      "emotion": "quiet"
    },
    {
      "type": "paragraph",
      "text": "On the other side, 1548 did not reply."
    },
    {
      "type": "paragraph",
      "text": "But the signal light was still on."
    }
  ]
}
