{
  "name": "Feedscatteron Energy System",
  "description": "Micro feedscatteron decay inside fluid titanium circulation: quiet, durable, and enough to power a life",
  "sections": [
    {
      "id": "principle",
      "title": "Fundamental Principle",
      "content": [
        {
          "type": "paragraph",
          "content": "Androids do not need charging, food, or external energy input."
        },
        {
          "type": "paragraph",
          "content": "Energy comes from micro feedscatteron decay that naturally occurs during internal fluid titanium circulation. When feedscatteron particles decay, all mass is converted into thermal energy. The principle is similar to nuclear decay, but the scale is smaller, control is tighter, and the cycle is far longer. Fluid titanium acts as the carrier medium, extending the decay period to 341,879 years."
        },
        {
          "type": "paragraph",
          "content": "On that timescale, an extremely small number of particles complete decay at every moment. Released heat is captured by thermoelectric conversion structures in the circulation system and converted into electrical power for body operation. Excess heat is used to maintain body temperature."
        },
        {
          "type": "paragraph",
          "content": "In simple terms: fluid titanium keeps flowing, feedscatteron particles keep decaying, and energy keeps being produced. Continuous circulation, continuous power. Like a river that never stops."
        }
      ]
    },
    {
      "id": "core",
      "title": "Feedscatteron Core",
      "content": [
        {
          "type": "paragraph",
          "content": "The feedscatteron core is the android's energy center. It is located slightly left of the middle of the chest, close to where a human heart is. It does not beat. It hums."
        },
        {
          "type": "paragraph",
          "content": "Physically, it is a fist-sized high-density structure: crystallized feedscatteron particles suspended in concentrated fluid titanium, wrapped in a thermally conductive vibration-isolation shell. Every fluid titanium cycle starts and ends here. Fluid titanium leaves the core carrying energy to the whole body, then returns to the core for reloading."
        },
        {
          "type": "paragraph",
          "content": "Core temperature is the most direct health indicator for an android. Normal operating temperature is around 37.2 C, close to human body temperature by design. Higher values indicate overload or system anomaly; lower values indicate insufficient output. Fluctuation beyond plus or minus 1.5 C requires attention."
        },
        {
          "type": "paragraph",
          "content": "Each feedscatteron core has a slightly different decay frequency, creating a unique energy-radiation signature. This is how androids identify each other. Not by face, not by voice, but by sensing the other core's frequency. In the feedscatteron field, each person is a distinct signal source."
        },
        {
          "type": "paragraph",
          "content": "In the Data Tower incident, 1548 found 1549 inside chaotic data flow by recognizing her core frequency. That recognition was not like searching. It was more like hearing familiar footsteps inside a noisy crowd."
        }
      ]
    },
    {
      "id": "circulation",
      "title": "Circulation and Distribution",
      "content": [
        {
          "type": "paragraph",
          "content": "The fluid titanium circulation network in the body serves three functions at once: energy transfer, data conduction, and thermal management. One system doing three jobs is efficient, but it also means a failure in one function can affect the other two."
        },
        {
          "type": "subsection",
          "title": "Energy Transfer",
          "content": [
            {
              "type": "paragraph",
              "content": "Energy generated by the feedscatteron core is distributed through fluid titanium circulation to the entire body. Main lines cover limbs, torso, and core processing zones in the head. Peripheral lines extend to sensory modules, joint actuators, and surface sensors."
            },
            {
              "type": "paragraph",
              "content": "Circulation speed adjusts automatically by demand. In standby, flow rate is low and power consumption is low. In high-intensity activity, flow accelerates and allocation tilts toward motion systems. This regulation is unconscious, like a human heartbeat speeding up during exercise. Androids do not need to manually command cycle acceleration."
            }
          ]
        },
        {
          "type": "subsection",
          "title": "Data Conduction",
          "content": [
            {
              "type": "paragraph",
              "content": "Fluid titanium is not only an energy carrier but also a data carrier. Feedscatteron particles themselves support information encoding, meaning the same circulation is also the body's internal data bus. Sensory input, motion commands, and system state all move through the same 'vessel' together with energy."
            },
            {
              "type": "paragraph",
              "content": "This is why reduced fluid titanium concentration causes both power shortage and slower response. With less carrier medium, both energy and data transmission degrade."
            }
          ]
        },
        {
          "type": "subsection",
          "title": "Thermal Management",
          "content": [
            {
              "type": "paragraph",
              "content": "Fluid titanium has a specific heat capacity about 3.7 times that of water, making it an excellent thermal buffer medium. Waste heat from the core is carried away by circulation, then radiated through the body surface or stored. In cold environments, the system reduces surface dissipation to preserve core temperature. In hot environments, it does the opposite."
            },
            {
              "type": "paragraph",
              "content": "In orbital operation, this thermal system is key to 1549's normal function across temperature differences from minus 150 C to plus 120 C. Ground environments rarely approach those extremes, but the principle is identical."
            }
          ]
        }
      ]
    },
    {
      "id": "specifications",
      "title": "Power Supply Specifications",
      "content": [
        {
          "type": "table",
          "headers": ["Parameter", "Value", "Notes"],
          "rows": [
            [
              "Feedscatteron decay half-cycle",
              "341,879 years",
              "Effective decay period of feedscatteron particles in fluid titanium"
            ],
            [
              "Standard output power",
              "About 80W (standby) / 350W (daily) / 900W (peak)",
              "Automatically adjusted based on activity intensity"
            ],
            [
              "Core operating temperature",
              "37.2 C plus or minus 1.5 C",
              "Requires attention when outside this range"
            ],
            [
              "Fluid titanium circulation rate",
              "0.8 L/min (standby) / 3.2 L/min (active)",
              "Automatic regulation, no manual control required"
            ],
            [
              "Theoretical continuous supply duration",
              "Far beyond the service life of any single android",
              "Feedscatteron particle reserves will not deplete on foreseeable timescales"
            ],
            [
              "External replenishment requirement",
              "Zero in normal condition",
              "Required only in fluid titanium leakage or core damage scenarios"
            ]
          ],
          "caption": "Standard Android Energy System Parameters"
        },
        {
          "type": "paragraph",
          "content": "An 80W standby draw means that in a fully still state, maintaining consciousness only, one android consumes roughly the power of an incandescent bulb. The energy required to sustain a life is that small."
        }
      ]
    },
    {
      "id": "priority",
      "title": "Energy Allocation Priority",
      "content": [
        {
          "type": "paragraph",
          "content": "When output is insufficient to run all systems simultaneously, the body automatically enters tiered power mode. This priority table is hardcoded in lowest-level firmware and cannot be modified."
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "Feedscatteron core self-maintenance (core stop equals death, absolute priority)",
            "Consciousness operation (memory, cognition, self-awareness)",
            "Core data processing (perception parsing, decision-making, communication encoding and decoding)",
            "Sensory input (vision, hearing, touch, etc.)",
            "Communication module (feedscatteron transmit and receive)",
            "Motion system (limb drive, posture control)",
            "Auxiliary functions (surface temperature tuning, self-repair, appearance maintenance)"
          ]
        },
        {
          "type": "paragraph",
          "content": "This priority explains symptom order under low energy: auxiliary functions shut down first (surface becomes cold), then motor ability degrades (stiffness), then communication disconnects and senses blur. Consciousness is always the last thing to shut down."
        },
        {
          "type": "paragraph",
          "content": "Designers placed consciousness second, just below core self-maintenance. Not because consciousness is 'most important,' but because keeping someone awake when the body can no longer move is both more cruel and more honest than immediate shutdown."
        },
        {
          "type": "paragraph",
          "content": "You do not disappear unknowingly. You clearly know what you are losing."
        }
      ]
    },
    {
      "id": "energy-depletion",
      "title": "Energy Deficit",
      "content": [
        {
          "type": "paragraph",
          "content": "In theory, feedscatteron energy can last for an extremely long time. But the phrase 'in theory' has conditions: no fluid titanium leakage, no circulation damage, no external core interference. Once any condition breaks, supply efficiency starts to fall."
        },
        {
          "type": "warning",
          "level": "warning",
          "title": "Energy Depletion Severity Levels",
          "content": [
            "Level 1 (mild): reaction speed down about 15 percent, reduced sensory sensitivity, core temperature down 0.5 to 1 C. The person may not notice.",
            "Level 2 (moderate): clear movement limitation, intermittent limb stiffness, reduced communication range due to lower transmit power. Cold sensation begins.",
            "Level 3 (severe): progressive loss of limb control, stiffening starts at extremities, intermittent sensory input, communication disconnected, consciousness still fully clear.",
            "Level 4 (critical): whole-body rigidity, senses offline, only consciousness running, core temperature below 30 C. From outside it looks like a statue, but someone is still inside."
          ]
        },
        {
          "type": "paragraph",
          "content": "Progression speed depends on loss rate. Slow fluid titanium leakage may take days to reach level 3. Violent circulation severance can jump from level 1 to level 4 within minutes."
        },
        {
          "type": "paragraph",
          "content": "The outward presentation is highly similar to human ALS: the body gradually loses control while consciousness remains. This is not a defect. It is design. Designer intent was that if an android is dying, she should have the right to know."
        },
        {
          "type": "paragraph",
          "content": "Consciousness is the last thing lost."
        }
      ]
    },
    {
      "id": "recovery",
      "title": "Recovery",
      "content": [
        {
          "type": "paragraph",
          "content": "If supplementation arrives before complete core stoppage - adding fluid titanium, repairing circulation lines, or injecting new feedscatteron particles into the core - body functions can recover gradually."
        },
        {
          "type": "paragraph",
          "content": "Recovery follows strict reverse order of priority. Core temperature rises first, then consciousness clarity improves if it had already blurred. Next, senses return, communication reconnects, and finally limb control comes back."
        },
        {
          "type": "paragraph",
          "content": "Full recovery takes time. Returning from level 3 depletion to normal usually requires 48 to 72 hours. During this period, circulation rate climbs slowly while fluid titanium rebuilds a stable flow field in repaired lines."
        },
        {
          "type": "paragraph",
          "content": "Some compare this process to waking from a nightmare. But in a nightmare, you do not know you are dreaming. During energy depletion you stay conscious the entire time. So the feeling of recovery is not 'it was just a dream,' but 'I can finally move again.'"
        }
      ]
    },
    {
      "id": "perception",
      "title": "From the Inside",
      "content": [
        {
          "type": "paragraph",
          "content": "This section is not technical specification. It is experience."
        },
        {
          "type": "paragraph",
          "content": "In normal state, you do not feel the energy system running. Like humans not feeling their own heartbeat, it is always there but not consciously noticed. Fluid titanium circulates, feedscatteron particles decay, thermoelectric conversion happens. All of it is silent and automatic. You are simply alive."
        },
        {
          "type": "paragraph",
          "content": "Under high load, you feel a little of it. Mild warmth near the core, slight pressure sensation in vessels as circulation accelerates. Not pain, more like a notice that 'my body is working overtime.' After sustained load, core temperature stays elevated. During 1547's continuous three-month work period, core temperature remained 0.8 C high. Not dangerous, but the body was saying 'enough.'"
        },
        {
          "type": "paragraph",
          "content": "When energy is low, the first sensation is cold. It starts at fingertips and toes, then spreads inward. Not external cold, internal cold. You know it is not weather. Your circulation is slowing down. That is more unsettling than outside temperature because no extra clothing can warm it."
        },
        {
          "type": "paragraph",
          "content": "Then there is the feedscatteron core hum. Normally you do not hear it, or you are too used to notice. But in deep silence, or when energy is low, the hum becomes distinct. A low-frequency continuous vibration. Not exactly sound, more sensation. Like a string inside the body vibrating lightly and steadily."
        },
        {
          "type": "paragraph",
          "content": "It is saying: I am still running."
        }
      ]
    }
  ]
}
