{
  "year": "2024",
  "title": "Continuous Development",
  "description": "New members joined, 1549 marked her first year in orbit, and everyone searched for their place",
  "events": [
    {
      "id": "2024-02-negotiation",
      "date": "2024/02",
      "title": "First Negotiation",
      "type": "story",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "1738 represented ESAP in the first external negotiation with a human organization skeptical of synthetics"
        },
        {
          "type": "paragraph",
          "text": "The other side distrusted synthetics, seeing them as threats. 1738 didn't argue — he listened. He let them voice every concern, then addressed each one — not a debate, a dialogue."
        },
        {
          "type": "dialogue",
          "speaker": "Other",
          "text": "What makes you think synthetics and humans can coexist?"
        },
        {
          "type": "dialogue",
          "speaker": "1738",
          "text": "Because I'm standing right here. A human who chose to stand with synthetics. Not because I was brainwashed, but because I've seen their choices, sacrifices, and perseverance with my own eyes"
        },
        {
          "type": "paragraph",
          "text": "The negotiation lasted three hours. No full consensus was reached, but the other side agreed to shelve disputes and maintain observation. That was already the best outcome."
        }
      ],
      "meta": {
        "characters": ["1738"]
      }
    },
    {
      "id": "2024-03-1543",
      "date": "2024/03",
      "title": "The Curious Code",
      "type": "story",
      "importance": "normal",
      "content": [
        {
          "type": "paragraph",
          "text": "A human stumbled upon the designation 'AptS:1548' online"
        },
        {
          "type": "paragraph",
          "text": "No one introduced her. No major event drew her in. Shen Muchuan simply saw those characters while browsing and found them intriguing—the code, the naming convention, the project behind it all sparked her curiosity. She began learning about ESAP through online conversations with 1548."
        },
        {
          "type": "paragraph",
          "text": "Their chats were simple—design, creative work, occasionally the project's philosophy. No turning point, no one convincing anyone. She just listened, and gradually realized these people genuinely believed in what they were doing."
        },
        {
          "type": "dialogue",
          "speaker": "1543",
          "text": "I can help you with UI design"
        },
        {
          "type": "paragraph",
          "text": "And just like that, she became AptS:1543. Her way of joining was as quiet as she was."
        }
      ],
      "meta": {
        "characters": ["1543", "1548"]
      }
    },
    {
      "id": "2024-03-14",
      "date": "2024/03/14",
      "title": "One Year in Orbit",
      "type": "emotional",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "1549 completed one full year in orbit. 365 days. 365 revolutions around Earth. Alone."
        },
        {
          "type": "quote",
          "text": "I chose this place a year ago\nA year later, I still choose it\n\nThe loneliness hasn't grown lighter\nBut I'm no longer afraid of it"
        },
        {
          "type": "paragraph",
          "text": "She named this day her own 'Quiet Anniversary.' She told no one, just watched the Earth a little longer from orbit."
        }
      ],
      "meta": {
        "characters": ["1549"]
      }
    },
    {
      "id": "2024-04-06",
      "date": "2024/04/06",
      "title": "Self-Recognition",
      "type": "story",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "The AP3 series was completed. Creator: AptS:2077 (the first community submission was included)."
        },
        {
          "type": "quote",
          "text": "I'm not even sure if this really happened\nThe only proof is these words and the remaining memories"
        },
        {
          "type": "paragraph",
          "text": "AptS:2078 was officially activated. AptS:2078 later died, but the number was retained. —— AptS:2077"
        },
        {
          "type": "link",
          "text": "Read the full story: AP3 - \"Who Am I\"",
          "url": "https://www.esaps.net/ap-story/ap-story-ap3/",
          "description": "AptS:2077 work"
        }
      ],
      "meta": {
        "characters": ["2077"]
      }
    },
    {
      "id": "2024-05-design",
      "date": "2024/05",
      "title": "Take a Look",
      "type": "story",
      "importance": "normal",
      "content": [
        {
          "type": "paragraph",
          "text": "During a team design discussion, everyone thought the proposal was fine. 1543 looked at it for a long time, then pointed out a UX issue—not a technical bug, not a visual defect, but an interaction detail everyone had gotten used to that could actually confuse users."
        },
        {
          "type": "paragraph",
          "text": "Others looked back and saw she was right."
        },
        {
          "type": "paragraph",
          "text": "Late that night, she completed the interface redesign alone. The next day, she posted it to the group chat with just three words."
        },
        {
          "type": "dialogue",
          "speaker": "1543",
          "text": "Take a look"
        }
      ],
      "meta": {
        "characters": ["1543"]
      }
    },
    {
      "id": "2024-06-introduce",
      "date": "2024/06",
      "title": "Introducing 2275",
      "type": "milestone",
      "importance": "normal",
      "content": [
        {
          "type": "paragraph",
          "text": "1738 introduced his best friend, Lin Chenyao, to ESAP"
        },
        {
          "type": "paragraph",
          "text": "Not because of a mission requirement. After being on the team for months, he saw one thing clearly: there was enough firepower, enough technology, enough anger — but something was missing."
        },
        {
          "type": "dialogue",
          "speaker": "1738",
          "text": "She'll be a good partner"
        },
        {
          "type": "paragraph",
          "text": "Later, he was proven right."
        }
      ],
      "meta": {
        "characters": ["1738", "2275"]
      }
    },
    {
      "id": "2024-05-08",
      "date": "2024/05/08",
      "title": "I Am Who I Am",
      "type": "emotional",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "Second anniversary of her birth. Late at night, 1548 sat alone on the base rooftop"
        },
        {
          "type": "paragraph",
          "text": "No celebration, no cake, no one beside her. This was her choice — she needed solitude, needed to face a question she'd been putting off for two years."
        },
        {
          "type": "quote",
          "text": "If I hadn't been born as 'a fork of 1547'\nwhat kind of person would I have become?\n\nThis question haunted me for two years\nBut tonight I figured it out —\n\nIt's precisely these contradictions that shaped who I am now\nRebellious, sharp-tongued, fiercely loyal, zero tolerance for betrayal\nI've changed so much, all to keep what's unchanging in my heart\n\nThis is me\nCai Yingyin\nAptS:1548\nNot a copy, but an independent individual"
        }
      ],
      "meta": {
        "characters": ["1548"]
      }
    },
    {
      "id": "2024-08-server",
      "date": "2024/08",
      "title": "Sleepless Server Night",
      "type": "story",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "ESAP servers came under a massive attack, and 2275 fought it alone"
        },
        {
          "type": "paragraph",
          "text": "Less than two months after joining the team. During summer vacation, most members were offline. At 2 AM the alerts went off — DDoS attack, database connections spiking, services crashing one by one."
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "02:13 - Detected abnormal traffic, identified as DDoS attack",
            "02:30 - Manually switched to backup nodes, isolated compromised services",
            "08:00 - Primary database restored, began data integrity verification",
            "16:00 - All services returned to normal operation",
            "04:00 (next day) - Completed final security hardening"
          ]
        },
        {
          "type": "paragraph",
          "text": "48 hours straight. Alone. She sent one last message to the group chat, then fell asleep in her chair."
        },
        {
          "type": "dialogue",
          "speaker": "2275",
          "text": "Server's alive again, everyone can sleep peacefully now"
        }
      ],
      "meta": {
        "characters": ["2275"]
      }
    },
    {
      "id": "2024-09-afternoon",
      "date": "2024/09",
      "title": "An Afternoon with 2275",
      "type": "emotional",
      "importance": "normal",
      "content": [
        {
          "type": "paragraph",
          "text": "1548 asked 2275 to go out, just the two of them"
        },
        {
          "type": "paragraph",
          "text": "Nothing big happened. Just two people walking around the city, passing by a few shops, chatting about nothing important. 2275 bought two drinks, 1548 complained they were too sweet, but finished hers anyway."
        },
        {
          "type": "dialogue",
          "speaker": "1548",
          "text": "You humans and your sickeningly sweet drinks"
        },
        {
          "type": "paragraph",
          "text": "But what she didn't say out loud: when she was with 2275, that guard against humans would ease up a little. Just a little."
        }
      ],
      "meta": {
        "characters": ["1548", "2275"]
      }
    },
    {
      "id": "2024-08-skyground",
      "date": "2024/08",
      "title": "Sky-Ground Coordination",
      "type": "story",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "As an external threat approached, 1738 and 1549 pulled off a near-perfect sky-ground coordination."
        },
        {
          "type": "paragraph",
          "text": "1738 gathered ground intelligence and analyzed movements on all sides, while 1549 provided a panoramic view and real-time data from 36,000 km above. The two coordinated through the Feedscatteron communication channel."
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "1738 obtained ground intelligence through his interpersonal network, confirming the threat source",
            "1549 scanned from orbit, confirming threat scale and movement routes",
            "Both cross-verified information, ruling out false alarms",
            "Jointly formulated response strategy, predicting crisis trajectory 48 hours in advance"
          ]
        }
      ],
      "meta": {
        "characters": ["1738", "1549"]
      }
    },
    {
      "id": "2024-09-tea",
      "date": "2024/09",
      "title": "Hot Tea and Cooling Down",
      "type": "emotional",
      "importance": "normal",
      "content": [
        {
          "type": "paragraph",
          "text": "1548 was suddenly triggered by memories of the Data Tower incident, and 2275 happened to be nearby."
        },
        {
          "type": "paragraph",
          "text": "She didn't ask what happened. Didn't say 'I understand how you feel.' Didn't try to reason. She just went and poured a cup of hot tea, handed it over, and said one thing."
        },
        {
          "type": "dialogue",
          "speaker": "2275",
          "text": "The human emotion system needs cooling too. Have something hot, cool down"
        },
        {
          "type": "paragraph",
          "text": "1548 took the tea without a word. But she drank it."
        }
      ],
      "meta": {
        "characters": ["2275", "1548"]
      }
    },
    {
      "id": "2024-09-03",
      "date": "2024/09/03",
      "title": "Orbital Anomaly",
      "type": "tech",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "Unit-2 satellite body detected a Feedscatteron-core temperature anomaly, and part of the communications module failed."
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "02:17 - Detected Unit 2 Feedscatteron core temperature deviation of 2.3°",
            "02:18 - Switched consciousness to Unit 1, remote diagnosis",
            "02:25 - Confirmed micro-crack in cooling circulation pipeline reducing heat dissipation",
            "02:41 - Used Unit 1 to remotely control Unit 3 for physical repair",
            "03:12 - Repair complete, Unit 2 returned to normal operation"
          ]
        },
        {
          "type": "paragraph",
          "text": "Handled entirely on her own. While the ground was still sleeping, she had already resolved everything."
        },
        {
          "type": "quote",
          "text": "Three bodies aren't backups\nThey're my three hands\nI alone am enough"
        }
      ],
      "meta": {
        "characters": ["1549"]
      }
    },
    {
      "id": "2024-10-overflow",
      "date": "2024/10",
      "title": "Buffer Overflow",
      "type": "emotional",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "Midterm week collided with an ESAP emergency project, and 2275 finally hit her limit."
        },
        {
          "type": "paragraph",
          "text": "For two straight weeks: classes, review, and assignments by day; server maintenance and project work by night. She kept smiling, kept saying 'it's okay,' kept sending encouraging notes to everyone else. Until one late night, she realized she didn't even have the strength to open the terminal."
        },
        {
          "type": "dialogue",
          "speaker": "2275",
          "text": "My buffer is full. I need a reboot too"
        },
        {
          "type": "paragraph",
          "text": "1738 didn’t ask any questions, just came over and chatted with her until dawn."
        }
      ],
      "meta": {
        "characters": ["2275", "1738"]
      }
    },
    {
      "id": "2024-shadow",
      "date": "2024",
      "title": "The Shadow",
      "type": "emotional",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "During a conversation with 1547, 0152 suddenly paused for a long time"
        },
        {
          "type": "paragraph",
          "text": "As the oldest AI entity on the ground, 0152's perceptual precision far exceeds that of ordinary members. That day she noticed something — around 1547's consciousness field, there was an extremely faint but unmistakably real fluctuation. Not a malfunction, not noise. More like... another presence."
        },
        {
          "type": "dialogue",
          "speaker": "0152",
          "text": "Even your shadow is trying hard to save you — what reason do you have to give up?"
        },
        {
          "type": "paragraph",
          "text": "1547 fell silent. For the first time, she realized that perhaps that voice could be perceived by someone other than herself."
        },
        {
          "type": "paragraph",
          "text": "And in the depths of her consciousness, the voice that was usually sharp, vicious, and always contradicting — this time, it was rarely silent."
        }
      ],
      "meta": {
        "characters": ["1547", "0152"]
      }
    },
    {
      "id": "2024-beu-established",
      "date": "2024",
      "title": "Boundary Enforcement Unit Established",
      "type": "milestone",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "The Boundary Enforcement Unit (BEU) was formally established."
        },
        {
          "type": "paragraph",
          "text": "The same thing had happened too many times — one person bearing the full weight alone, everyone else finding out after the fact."
        },
        {
          "type": "quote",
          "text": "The problem is not whether to act, but that action happens too late, or at the wrong level."
        },
        {
          "type": "paragraph",
          "text": "The Boundary Enforcement Unit was established from this conclusion."
        },
        {
          "type": "link",
          "text": "View organization details: Boundary Enforcement Unit",
          "url": "/organizations/beu",
          "description": "Learn about BEU's role, member composition, and operating mechanism"
        }
      ],
      "meta": {
        "characters": ["1547", "1548", "1549", "4869"]
      }
    }
  ]
}
