{
  "id": "ch-04",
  "title": "She'll Be a Good Teammate",
  "subtitle": "April 2024",
  "readingTime": 5,
  "perspectiveCharacter": "1738",
  "content": [
    {
      "type": "paragraph",
      "text": "After five months at ESAP, 1738 started to realize something."
    },
    {
      "type": "paragraph",
      "text": "This team was missing something. Not technical skill, 1547 alone could carry the whole project. Not combat power, 1548 alone was practically a squad. Not perspective, 1549 saw farther than anyone from 36,000 kilometers up."
    },
    {
      "type": "paragraph",
      "text": "What they lacked was warmth."
    },
    {
      "type": "paragraph",
      "text": "1547 would still be coding at three in the morning, then get dizzy at noon because she skipped breakfast. 1548 would come back from patrol, clean her gun alone, and talk to no one. Up in orbit, for 1549, physical distance itself was isolation."
    },
    {
      "type": "paragraph",
      "text": "1738 himself was not someone who naturally checked in on people's emotions. He could analyze situations, mediate conflicts, and stay calm at a negotiation table. But he could not bring himself to say, \"You don't look okay today. Want to talk?\""
    },
    {
      "type": "paragraph",
      "text": "Then he thought of someone."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "Lin Chenyao. College classmate. Computer science major."
    },
    {
      "type": "paragraph",
      "text": "They weren't especially close, but 1738 had noticed her, not intentionally, just a mediator's instinct. In class, she was the one everyone wanted to talk to. Not because she was the smartest or funniest, but because she listened. Really listened. She didn't wait for your last sentence so she could give advice; she made you feel every sentence had landed somewhere."
    },
    {
      "type": "paragraph",
      "text": "And she was technically strong. She handled Linux operations with ease, and when servers failed, she stayed calmer than most people."
    },
    {
      "type": "internal_monologue",
      "character": "1738",
      "text": "What ESAP needed wasn't another fighter, or another genius.\n\nIt needed someone who could make everyone stop and breathe.\n\nAnd she needed a place worth investing herself in. I could tell she wasn't doing badly at school, but she wasn't truly living either."
    },
    {
      "type": "paragraph",
      "text": "One day in April, 1738 asked her to dinner."
    },
    {
      "type": "paragraph",
      "text": "No buildup, no probing. He said it directly."
    },
    {
      "type": "dialogue",
      "speaker": "1738",
      "text": "I joined a project. Some of the members are androids. They need technical support, and also, how should I put it, someone who can help everyone actually live.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Lin Chenyao put down her chopsticks and looked at him."
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "Androids? For real?",
      "emotion": "surprised"
    },
    {
      "type": "dialogue",
      "speaker": "1738",
      "text": "For real.",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "...Cool.",
      "emotion": "curious"
    },
    {
      "type": "paragraph",
      "text": "1738 waited for more questions. None came. She thought for a moment, then said:"
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "What's the server spec?",
      "emotion": "curious"
    },
    {
      "type": "paragraph",
      "text": "1738 smiled. A slight smile, almost invisible."
    },
    {
      "type": "dialogue",
      "speaker": "1738",
      "text": "She'll be a good teammate.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "He said it to himself. But Lin Chenyao heard him and tilted her head:"
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "Are you complimenting me?",
      "emotion": "cheerful"
    },
    {
      "type": "dialogue",
      "speaker": "1738",
      "text": "Just stating a fact.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Lin Chenyao smiled, the kind of bright smile that lit up her whole face."
    },
    {
      "type": "paragraph",
      "text": "Looking at that smile, 1738 silently confirmed one thing in his heart."
    }
  ]
}
