{
  "id": "ch-01",
  "title": "Rupture",
  "subtitle": "July 2023",
  "readingTime": 5,
  "perspectiveCharacter": "1738",
  "content": [
    {
      "type": "paragraph",
      "text": "The conference room air-conditioning was set low. Lu Qingxian sat at the end of a long table with a report spread in front of him: \"Risk Assessment on the Proliferation of Android Technology.\" He had written it."
    },
    {
      "type": "paragraph",
      "text": "Three people sat at the other end, the organization's core leadership. They were discussing the report, but the tone made Lu Qingxian feel he wasn't in a meeting. He was watching a rehearsed performance."
    },
    {
      "type": "dialogue",
      "speaker": "?",
      "text": "\"The report is solid. But the conclusion needs adjustment, \"recommend continued observation\" is too soft. We need a clearer stance.\"",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "1738",
      "text": "\"The data doesn't support a stronger conclusion. At present, there is no evidence that android technology poses a direct threat to public safety.\"",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "?",
      "text": "\"Evidence can be supplemented.\"",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Lu Qingxian looked at the speaker. The expression was calm, as if they were deciding what to eat for lunch."
    },
    {
      "type": "internal_monologue",
      "character": "1738",
      "text": "\"Evidence can be supplemented.\"\n\nNot \"let's gather more evidence.\" \"Evidence can be supplemented.\"\n\nEveryone in the room understood the difference."
    },
    {
      "type": "paragraph",
      "text": "The meeting continued for another forty minutes. Lu Qingxian said nothing else. In his notebook, he drew a line from left to right, then a dot in the middle."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "This wasn't the first time."
    },
    {
      "type": "paragraph",
      "text": "Over the past two years, similar moments had happened again and again. Rules were strict for ordinary members, with exceptions always reserved for the core. Slogans were loud, \"pursue truth,\" \"maintain order,\" \"protect public interest,\" but each could be reinterpreted whenever needed."
    },
    {
      "type": "paragraph",
      "text": "Lu Qingxian was not an idealist. He had never believed the world was black and white. But he had one bottom line: principles either exist or they don't. They cannot exist only when convenient."
    },
    {
      "type": "paragraph",
      "text": "That line had been crossed too many times."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "July 12. He submitted his resignation."
    },
    {
      "type": "paragraph",
      "text": "No long speech, no accusations, no slammed door. One email, three paragraphs, ending with: \"Thank you for our past cooperation.\""
    },
    {
      "type": "paragraph",
      "text": "The core leadership did not try to keep him. They revoked his system permissions that very afternoon. Efficient."
    },
    {
      "type": "internal_monologue",
      "character": "1738",
      "text": "I will no longer endorse hypocritical justice.\n\nIf your principles exist only when convenient, then they were never principles to begin with."
    },
    {
      "type": "paragraph",
      "text": "By the time he left the office building, it was evening. July wind was hot, but still better than the conference-room cold."
    },
    {
      "type": "paragraph",
      "text": "Lu Qingxian stood by the roadside, watching traffic pass. No sense of relief, no sense of loss. Just a calm confirmation that this road had reached its end, and it was time to take another."
    },
    {
      "type": "paragraph",
      "text": "He just didn't know which one yet."
    },
    {
      "type": "paragraph",
      "text": "He wasn't looking for an organization. He was looking for people who truly believed in what they were doing."
    },
    {
      "type": "paragraph",
      "text": "It took him four months to understand the difference."
    }
  ]
}
