{
  "id": "ch-06",
  "title": "Hot Tea",
  "subtitle": "September 2024",
  "readingTime": 5,
  "perspectiveCharacter": "2275",
  "content": [
    {
      "type": "paragraph",
      "text": "One evening in September, 2275 was boiling water in the base kitchen."
    },
    {
      "type": "paragraph",
      "text": "She had just had milk tea, so this wasn't for herself. It was because, while passing the hallway, she heard something."
    },
    {
      "type": "paragraph",
      "text": "Not loud. Metal striking a table, then silence. The kind of silence where someone sets something down hard and then forces themselves not to move."
    },
    {
      "type": "paragraph",
      "text": "2275 leaned over and took a quick look."
    },
    {
      "type": "paragraph",
      "text": "1548 sat in the room. A butterfly knife was embedded in the tabletop, its blade still trembling. Her hands braced the table edge, knuckles white."
    },
    {
      "type": "paragraph",
      "text": "2275 recognized that state. Anger has movement, has noise. This was past anger. A memory had been triggered, and the whole person was pinned in place."
    },
    {
      "type": "internal_monologue",
      "character": "2275",
      "text": "The Data Tower incident.\n\nIt was September now. Two years ago in September, DT-03.\n\nThe day she lost color vision."
    },
    {
      "type": "paragraph",
      "text": "2275 didn't go in. She turned toward the kitchen, boiled water, and made a cup of tea. The base only had plain green tea bags, but at least it was hot."
    },
    {
      "type": "paragraph",
      "text": "She carried the tea to the doorway and lightly knocked on the frame."
    },
    {
      "type": "paragraph",
      "text": "1548 looked up at her. Her gaze was cold, the kind of cold that freezes everything so you don't shatter. It wasn't aimed at 2275."
    },
    {
      "type": "paragraph",
      "text": "2275 set the cup on the table, well away from the butterfly knife."
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "Human emotional systems need cooling too. Drink something hot and let your temperature drop.",
      "emotion": "gentle"
    },
    {
      "type": "paragraph",
      "text": "1548 looked at her. Then at the cup."
    },
    {
      "type": "paragraph",
      "text": "2275 said nothing else. No \"Are you okay?\" No \"I understand how you feel.\" She didn't try to comfort or fix. She just put the tea there and leaned on the doorframe, quietly present."
    },
    {
      "type": "paragraph",
      "text": "A long time passed."
    },
    {
      "type": "paragraph",
      "text": "1548 reached out and picked up the cup."
    },
    {
      "type": "paragraph",
      "text": "She took a sip. It wasn't good, the tea bag had steeped too long and turned bitter. But it was hot."
    },
    {
      "type": "paragraph",
      "text": "2275 watched her drink in silence. Outside, the sky was dimming; September evenings arrived earlier than summer."
    },
    {
      "type": "paragraph",
      "text": "1548 set the cup down."
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Aren't you afraid of me?",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "Afraid of what?",
      "emotion": "gentle"
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "I don't trust humans. You know that.",
      "emotion": "cold"
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "Yeah. I know.",
      "emotion": "gentle"
    },
    {
      "type": "paragraph",
      "text": "2275 smiled, just a little."
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "But tea doesn't care whether you're human or android. Hot is hot.",
      "emotion": "gentle"
    },
    {
      "type": "paragraph",
      "text": "1548 didn't answer. But she finished the tea."
    },
    {
      "type": "paragraph",
      "text": "As 2275 took the empty cup, 1548 said one thing:"
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Steep it longer next time.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "2275 froze for a beat, then broke into a bright smile."
    },
    {
      "type": "dialogue",
      "speaker": "2275",
      "text": "Deal.",
      "emotion": "cheerful"
    },
    {
      "type": "scene_break",
      "style": "fade"
    },
    {
      "type": "internal_monologue",
      "character": "2275",
      "text": "1738 asked me later what happened that day. I said, \"Nothing much. Just made a cup of tea.\"\n\nHe looked at me once and didn't ask again.\n\nI think he understood. Some things don't require much. You just place the right thing in the right spot at the right time.\n\nOne cup of hot tea. That's enough."
    },
    {
      "type": "paragraph",
      "text": "After that, 2275 noticed something: 1548 spoke to her more often. Not friendly, 1548 wasn't friendly with anyone. But when 2275 passed by, she'd occasionally say something."
    },
    {
      "type": "paragraph",
      "text": "Like, \"There's an anomaly in today's server log. Take a look.\""
    },
    {
      "type": "paragraph",
      "text": "Or, \"Kitchen's running out of tea bags.\""
    },
    {
      "type": "paragraph",
      "text": "That's just how 1548 is."
    }
  ]
}
