{
  "id": "ch-03",
  "title": "Distance",
  "subtitle": "April 2024",
  "readingTime": 4,
  "perspectiveCharacter": "1543",
  "content": [
    {
      "type": "paragraph",
      "text": "After joining ESAP, Shen Muchuan started reading the profiles of the other members."
    },
    {
      "type": "paragraph",
      "text": "1549, in orbit. 1738, human, Mediator. 2275, human, Healer. And 1547."
    },
    {
      "type": "paragraph",
      "text": "She spent a long time on 1547's profile."
    },
    {
      "type": "paragraph",
      "text": "There really was a lot there, but volume was not why it took her an entire afternoon. After finishing, she was left with a feeling that was hard to name. Not fear. Not admiration. Not aversion. Just... distance."
    },
    {
      "type": "paragraph",
      "text": "1547 felt too dense."
    },
    {
      "type": "paragraph",
      "text": "Her experience, her emotions, even her very existence carried a powerful density. Like a painting with saturation pushed to the limit: every pixel straining, every detail trying to say something."
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan was not used to that kind of density. She was the kind of person who left a lot of blank space. In her work, the most important part was often the empty part."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "She never told anyone this."
    },
    {
      "type": "paragraph",
      "text": "In the group chat, her interactions with 1547 were normal: replying to work messages, confirming design requirements, occasionally sending \"ok\" or \"received.\" Online communication was fine."
    },
    {
      "type": "paragraph",
      "text": "But when it came to meeting offline, she kept avoiding it."
    },
    {
      "type": "paragraph",
      "text": "1548 asked once."
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "47 said she wants to meet and talk about design.",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "1543",
      "text": "Online is fine.",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Up to you.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "1548 did not press. That was one of the reasons Shen Muchuan liked her: she never pressed."
    },
    {
      "type": "scene_break",
      "style": "fade"
    },
    {
      "type": "paragraph",
      "text": "One evening in April, Shen Muchuan drew a picture on her tablet."
    },
    {
      "type": "paragraph",
      "text": "There were two people in the image. One close, with a sharp outline. One far away, only a blurred silhouette. A large stretch of blank space between them."
    },
    {
      "type": "paragraph",
      "text": "She looked at it for a while, saved it to her private folder, and sent it to no one."
    }
  ]
}
