{
  "id": "ch-05",
  "title": "Three Views",
  "subtitle": "Summer 2024",
  "readingTime": 6,
  "perspectiveCharacter": "1543",
  "content": [
    {
      "type": "paragraph",
      "text": "Shen Muchuan had a habit: before formal design work, she drew the people first."
    },
    {
      "type": "paragraph",
      "text": "Character reference sheets. Front, side, back. Detail notes. Color notes. Three views. An instinct from formal design training: understand who the subject is before discussing anything else."
    },
    {
      "type": "paragraph",
      "text": "In July, she created a new folder."
    },
    {
      "type": "paragraph",
      "text": "\"ESAP Member References.\""
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "1738 was easy to draw."
    },
    {
      "type": "paragraph",
      "text": "Clean lines, no unnecessary curves. His posture carried a relaxed readiness: taut but never tense, ready to move at any time. She spent about an hour and in the end decided not to draw his front view, but the angle where he lowered his head to flip through documents. That felt more accurate."
    },
    {
      "type": "paragraph",
      "text": "2275 had joined only the month before. She was always in motion, never in the same pose in any two photos, always doing something or passing something to someone. Shen Muchuan thought about it and picked one gesture: an outstretched hand passing something to someone off-frame. The blank space was left on the right side."
    },
    {
      "type": "paragraph",
      "text": "The composition felt right to her."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "1549 was impossible to meet in person."
    },
    {
      "type": "paragraph",
      "text": "36,000 kilometers. A voice in data streams, two old photos from before launch, and countless brief communication logs."
    },
    {
      "type": "paragraph",
      "text": "She opened a canvas and started directly, without references."
    },
    {
      "type": "paragraph",
      "text": "It came surprisingly smoothly."
    },
    {
      "type": "paragraph",
      "text": "Freed from the pressure of \"it has to look exactly right,\" she drew the 1549 she felt: expansive, elevated, surrounded by a special kind of light. Light falling from very far away, spread evenly, stable and non-harsh. The background stayed very open. The character sat high in the frame. Three bodies existed, but she drew only one and left positions for the other two."
    },
    {
      "type": "internal_monologue",
      "character": "1543",
      "text": "Maybe not meeting someone lets you see them more clearly."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "Then came 1547."
    },
    {
      "type": "paragraph",
      "text": "She was stuck here for three days."
    },
    {
      "type": "paragraph",
      "text": "There was too much material. Every record carried weight, every detail connected to a story. She reread everything, drew a few lines, crossed them all out, then closed the canvas and did something else."
    },
    {
      "type": "paragraph",
      "text": "Late on the fourth night, she opened the file again."
    },
    {
      "type": "paragraph",
      "text": "After about two hours of drawing, her right eye started to hurt. The dull ache of astigmatism after heavy eye use. Not severe, just irritating. She set the pen down, removed her eye patch, and gently pressed the corner of her eye. The screen was too bright; her right eye kept avoiding it on instinct."
    },
    {
      "type": "paragraph",
      "text": "She put the eye patch back on and kept looking at the canvas."
    },
    {
      "type": "paragraph",
      "text": "Half a face was there. The linework cut off midway."
    },
    {
      "type": "paragraph",
      "text": "Looking at that half face, she realized something: she had been trying to draw everything about 1547 at once."
    },
    {
      "type": "paragraph",
      "text": "It would not work."
    },
    {
      "type": "paragraph",
      "text": "She cleared the canvas, thought for a while, and decided to draw only three things."
    },
    {
      "type": "paragraph",
      "text": "The eyes. Red and blue. Two colors, one face. She spent a long time here, painting the colors with care."
    },
    {
      "type": "paragraph",
      "text": "The burn scar on one side of the face. Not dramatized, not emphasized. Just there, together with the other details."
    },
    {
      "type": "paragraph",
      "text": "One gesture: the head tilted slightly, as if thinking about something, or maybe nothing at all."
    },
    {
      "type": "paragraph",
      "text": "A lot of blank space."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "She sent this batch of references to the group."
    },
    {
      "type": "paragraph",
      "text": "2275 sent a string of voice messages. 1738 said, \"Professional.\" 1549 replied briefly that she had seen them, and thanked her."
    },
    {
      "type": "paragraph",
      "text": "1548 said nothing in the group. But that night, she sent Shen Muchuan a private message."
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "The 1547 one. You got it right.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan looked at the message and did not reply immediately."
    },
    {
      "type": "paragraph",
      "text": "Hearing \"you got it right\" from 1548 carried more weight than any praise."
    },
    {
      "type": "paragraph",
      "text": "1547 said one line in the group."
    },
    {
      "type": "dialogue",
      "speaker": "1547",
      "text": "...How did you know to draw those parts?",
      "emotion": "gentle"
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan did not reply."
    },
    {
      "type": "paragraph",
      "text": "She sat in front of her tablet and did not reply. Her right eye still had a trace of dull pain. She touched the edge of her eye patch and said nothing."
    }
  ]
}
