{
  "id": "ch-01",
  "title": "Designation",
  "subtitle": "March 2024",
  "readingTime": 4,
  "perspectiveCharacter": "1543",
  "content": [
    {
      "type": "paragraph",
      "text": "Shen Muchuan first noticed that string of characters while scrolling on her phone."
    },
    {
      "type": "paragraph",
      "text": "AptS:1548."
    },
    {
      "type": "paragraph",
      "text": "While browsing a tiny design forum, she happened to see a thread discussing a project's visual style. The palette was yellow, pink, and blue: clean, crisp, and instantly recognizable. Popular posts usually never reached corners like that, and recommendation algorithms certainly did not push them to her."
    },
    {
      "type": "paragraph",
      "text": "She clicked in for a quick look. Then she saw the designation."
    },
    {
      "type": "paragraph",
      "text": "AptS:1548. Four letters, one colon, four digits. It looked like a serial number, and also like a codename. She did not know what it meant, but she thought it looked good. Not \"interesting,\" not \"I want to understand it\". Just simply: good-looking."
    },
    {
      "type": "paragraph",
      "text": "The typography of the designation itself, the spacing around the colon, the rhythm between letters and numbers. As a design student, she had an instinctive sensitivity to this kind of thing."
    },
    {
      "type": "paragraph",
      "text": "She took a screenshot and saved it to her inspiration folder."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "Then she started looking it up."
    },
    {
      "type": "paragraph",
      "text": "Not in any serious way, either. Just quick searches while scrolling before bed, or opening a tab for a glance during boring classes. AptS was a designation system. And 1548 was a... android?!"
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan stared at the information on the screen for a while."
    },
    {
      "type": "paragraph",
      "text": "An android. Okay."
    },
    {
      "type": "paragraph",
      "text": "She was not shocked. She was not scared. Her first reaction was: this project's visual system is already good, but it could be better."
    },
    {
      "type": "paragraph",
      "text": "That was probably just how a designer's brain worked."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "She found 1548's online contact. After two days of hesitation, she sent a message."
    },
    {
      "type": "dialogue",
      "speaker": "1543",
      "text": "Hi. I saw your project's color system and wanted to chat.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Three days later, a reply came."
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Chat about what?",
      "emotion": "cold"
    },
    {
      "type": "paragraph",
      "text": "Two words. No greeting, no pleasantries."
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan looked at those two words and thought: nice. No small talk needed."
    },
    {
      "type": "dialogue",
      "speaker": "1543",
      "text": "The three-color system is good. But it lacks layering.",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "You work in design?",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "1543",
      "text": "Mm.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "And that was how the conversation began. Two people with few words, exchanging information in the shortest possible sentences."
    }
  ]
}
