{
  "id": "ch-06",
  "title": "Gift",
  "subtitle": "Spring 2025",
  "readingTime": 5,
  "perspectiveCharacter": "1543",
  "content": [
    {
      "type": "paragraph",
      "text": "No one asked her to draw these things."
    },
    {
      "type": "paragraph",
      "text": "She just noticed things, drew them, and sent them out. That was all."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "1549's messages always had a distinct texture: seeing the whole from above, knowing where everyone was, and speaking only after grasping the full picture. Shen Muchuan was not sure when she started noticing that."
    },
    {
      "type": "paragraph",
      "text": "One afternoon, she drew an image."
    },
    {
      "type": "paragraph",
      "text": "Earth viewed from very high above. Curves, broad bands of blue, and several thin lines extending downward, connecting to a few indistinct points on the ground."
    },
    {
      "type": "paragraph",
      "text": "She sent it to 1549 in a private message. No explanation, just: \"For you.\""
    },
    {
      "type": "paragraph",
      "text": "An hour later, a reply came."
    },
    {
      "type": "dialogue",
      "speaker": "1549",
      "text": "Thanks. I looked at it for a long time.",
      "emotion": "gentle"
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan saved that message. She was not quite sure why."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "2275 had a hard autumn. Shen Muchuan said nothing then. She did not know what to say. But she remembered it."
    },
    {
      "type": "paragraph",
      "text": "In March, she drew a small image: a server cabinet with one light still on, and a few tiny words at the bottom."
    },
    {
      "type": "paragraph",
      "text": "\"Still running.\""
    },
    {
      "type": "paragraph",
      "text": "She sent it to 2275 with no explanation."
    },
    {
      "type": "paragraph",
      "text": "2275 first sent three voice messages, then a text apologizing for sending so many voice messages, then another voice message apologizing that the previous apology had been in text."
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan looked at that string of notifications, put on her headphones, and did not listen right away."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "In one group chat, when 1738 sent a desktop photo, the lower-right corner revealed part of a notebook."
    },
    {
      "type": "paragraph",
      "text": "A few rough line sketches of people were visible on the page."
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan saw them and said nothing."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "That night, she opened her private folder."
    },
    {
      "type": "paragraph",
      "text": "She counted: forty-seven."
    },
    {
      "type": "paragraph",
      "text": "The earliest ones were from spring 2024: two people, one clear, one blurred, a large blank space between them. She looked at that drawing for a while."
    },
    {
      "type": "paragraph",
      "text": "The recent ones had more people, more lines. Distances between people were closer than before, but they were not crowded together."
    },
    {
      "type": "paragraph",
      "text": "Then she noticed that a few drawings were no longer in this folder."
    },
    {
      "type": "paragraph",
      "text": "Not many. Most were still there. But a few had already gone."
    },
    {
      "type": "scene_break",
      "style": "fade"
    },
    {
      "type": "paragraph",
      "text": "She closed the folder and opened a new canvas."
    },
    {
      "type": "paragraph",
      "text": "She still did not know what to draw."
    },
    {
      "type": "paragraph",
      "text": "But she knew where those lines were now."
    }
  ]
}
