{
  "id": "ch-02",
  "title": "Online",
  "subtitle": "March 2024",
  "readingTime": 4,
  "perspectiveCharacter": "1543",
  "content": [
    {
      "type": "paragraph",
      "text": "Talking with 1548 settled into a steady rhythm."
    },
    {
      "type": "paragraph",
      "text": "Not every day. Sometimes every two or three days, sometimes once a week. But every time they talked, it was the kind of conversation that needed no warm-up: straight to the point, then done. No extra pleasantries."
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan rarely met people like that. Most conversations needed setup: \"How have you been?\" \"Have you eaten?\" \"What are you doing?\" 1548 did not need any of it. Her messages always went straight to the point. Her replies were always short. No emojis. No filler words."
    },
    {
      "type": "paragraph",
      "text": "That made Shen Muchuan feel at ease."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "At first, they talked about design. Shen Muchuan showed 1548 a few UI sketches she had drawn, and 1548 replied with one line: \"Not ugly.\" Shen Muchuan only learned later that, in 1548's rating system, that was already high praise."
    },
    {
      "type": "paragraph",
      "text": "Later, the topic drifted. From design to creation, from creation to aesthetics, from aesthetics to..."
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Why do you draw?",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan thought for a long time. She knew the answer, but could not find the words."
    },
    {
      "type": "dialogue",
      "speaker": "1543",
      "text": "Because some things can't be said.",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Like what?",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan did not reply with words. She drew a small picture and sent it: someone sitting by a window, headphone cable hanging down, a blurred city skyline outside. No expression, no text, but anyone who saw it could feel that quiet state of not needing to be disturbed."
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Got it.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Two words."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "One evening in late March, 1548 sent a message."
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Our project needs someone for UI.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Shen Muchuan looked at that message. Just a statement, not one extra word."
    },
    {
      "type": "dialogue",
      "speaker": "1543",
      "text": "I can help with UI design.",
      "emotion": "neutral"
    },
    {
      "type": "dialogue",
      "speaker": "1548",
      "text": "Okay.",
      "emotion": "neutral"
    },
    {
      "type": "paragraph",
      "text": "Just like that, Shen Muchuan became AptS:1543."
    },
    {
      "type": "paragraph",
      "text": "No ceremony, no declaration. Just one short exchange between two people who did not talk much."
    }
  ]
}
