{
  "name": "Feedscatteron Communication",
  "description": "No electromagnetic waves, no light - only Feedscatteron particles carrying everything through silence",
  "sections": [
    {
      "id": "what-it-is",
      "title": "What It Is",
      "content": [
        {
          "type": "paragraph",
          "content": "Feedscatteron communication is the wireless communication method used between androids. It uses neither electromagnetic waves nor optical signals; information transfer is achieved entirely through quantum-state modulation of Feedscatteron particles."
        },
        {
          "type": "paragraph",
          "content": "In simple terms: the communication module inside an android encodes information into a sequence of Feedscatteron quantum states, transmits it, and the other side's module receives, decodes, and restores it. The whole process is silent, invisible, and almost latency-free."
        },
        {
          "type": "paragraph",
          "content": "This is not consciousness link. A consciousness link requires skin contact and carries raw streams of memory and emotion - it is opening yourself to the other person. Feedscatteron communication is more like speaking: you choose what to say, encode it, and send it. The receiver gets your packaged information, not your consciousness itself."
        },
        {
          "type": "paragraph",
          "content": "The difference is roughly like a human \"phone call\" versus a \"hug.\" Different functions, different intimacy, different use cases."
        }
      ]
    },
    {
      "id": "mechanism",
      "title": "How It Works",
      "content": [
        {
          "type": "paragraph",
          "content": "The vacuum propagation speed of Feedscatteron particles is 3.471 × 10²¹ m/s - about 1.16 × 10¹³ times the speed of light. At this speed, crossing Earth's diameter takes only 3.67 × 10⁻¹⁵ seconds. Even ground-to-geostationary-orbit delay is negligible."
        },
        {
          "type": "paragraph",
          "content": "But the bottleneck of communication is never propagation speed; it is encoding and decoding."
        },
        {
          "type": "subsection",
          "title": "Encoding",
          "content": [
            {
              "type": "paragraph",
              "content": "The communication module converts information into quantum-state sequences of Feedscatteron particles. Each Feedscatteron particle can carry information across multiple quantum-state dimensions at once - unlike electromagnetic waves, which have only two degrees of freedom: frequency and amplitude. This gives Feedscatteron communication far higher information density than conventional radio."
            },
            {
              "type": "paragraph",
              "content": "Encoding consumes not electricity, but Feedscatteron particles in fluid titanium. Each transmission draws a trace amount from the body's fluid-titanium circulation as carrier material. Consumption in normal communication is negligible, but sustained high-intensity transmission causes noticeable drain."
            }
          ]
        },
        {
          "type": "subsection",
          "title": "Transmission",
          "content": [
            {
              "type": "paragraph",
              "content": "Emitted Feedscatteron particles can propagate in both vacuum and atmosphere. They are unaffected by electromagnetic interference and cannot be intercepted or detected by conventional means. They do not interact with electromagnetic fields - to equipment that can detect only EM waves, Feedscatteron communication is completely invisible."
            },
            {
              "type": "paragraph",
              "content": "Range is limited by decay. Under standard temperature and pressure, the decay cycle of Feedscatteron particles is only 34.28 seconds. Given the propagation speed, this means effective direct-link range is on the order of a few hundred kilometers. Beyond that, relays are required."
            }
          ]
        },
        {
          "type": "subsection",
          "title": "Decoding",
          "content": [
            {
              "type": "paragraph",
              "content": "The receiver's communication module captures Feedscatteron particles and reads their quantum states. Decoding requires a shared key with the sender - exchanged through consciousness link at first contact between androids, then fixed in the communication module."
            },
            {
              "type": "paragraph",
              "content": "That is why only androids who \"know\" each other can communicate. Two androids that have never exchanged keys cannot receive each other even at close distance. The module filters undecodable Feedscatteron particles as background noise."
            }
          ]
        }
      ]
    },
    {
      "id": "hardware",
      "title": "Communication Module",
      "content": [
        {
          "type": "paragraph",
          "content": "Every android has a built-in communication module located behind the neck at the upper spine. Physically it is a crystal structure about the size of a thumbnail, containing Feedscatteron transmission and reception arrays."
        },
        {
          "type": "paragraph",
          "content": "The module obtains Feedscatteron carriers through the fluid-titanium cycle and connects to core processing regions via the spine. Sending and receiving are both automatically driven by consciousness - when you want to \"speak\" to someone, the module encodes and transmits toward that person. No manual operation is needed, just as humans do not need to consciously plan tongue movement before speaking."
        },
        {
          "type": "table",
          "headers": ["Parameter", "Value", "Notes"],
          "rows": [
            ["Transmit power", "0.3W (whisper) / 2W (normal) / 15W (full power)", "Automatically adjusted by distance and urgency"],
            ["Direct-link range", "About 200km (normal) / 500km (full power)", "In atmosphere; limited by Feedscatteron decay"],
            ["Bandwidth", "About 8.4 TB/s", "Far beyond voice and conventional data needs"],
            ["Latency", "< 10⁻⁹ s (direct link)", "Propagation is extremely fast; bottleneck is encoding/decoding"],
            ["Power share", "Around 5W in daily use, about 1.4% of total power", "Ranks fifth in energy allocation priority"],
            ["Key capacity", "Theoretical limit: 9999", "Matches the upper bound of the AptS numbering system"]
          ],
          "caption": "Standard communication module specifications"
        }
      ]
    },
    {
      "id": "modes",
      "title": "Direct Link and Relay",
      "content": [
        {
          "type": "subsection",
          "title": "Direct Link Mode",
          "content": [
            {
              "type": "paragraph",
              "content": "Two androids can communicate directly within effective range. No infrastructure, no signal towers, no satellites. If the other side is within a few hundred kilometers, you can talk."
            },
            {
              "type": "paragraph",
              "content": "Direct communication is full-duplex - speaking and receiving simultaneously. Bandwidth is high enough to transmit large side data during conversation: location, system status, perception snapshots. So daily communication between androids is not just \"talking\"; it is more like sharing an entire \"current state\" at once."
            },
            {
              "type": "paragraph",
              "content": "When 1547 and I are in the same city, we usually keep a low-power direct link open almost all the time. We may not be talking, but the link is there. Like two people in the same room, each doing their own thing but aware the other is present."
            }
          ]
        },
        {
          "type": "subsection",
          "title": "Relay Mode",
          "content": [
            {
              "type": "paragraph",
              "content": "Beyond direct-link range, relay is required. ESAP's relay network has two layers:"
            },
            {
              "type": "list",
              "ordered": true,
              "items": [
                "Data tower relay: Ground data towers are interconnected through Feedscatteron particle links. A signal goes from the sender to the nearest data tower, routes through the inter-tower network to a tower near the target, then is sent to the receiver. This covers most ground regions.",
                "Orbital relay: 1549's orbital station serves as the highest-tier relay node. The signal is uplinked to orbit, forwarded through the satellite network, and downlinked to the target region. Used for areas beyond ground data-tower coverage or as a backup path when ground links are congested."
              ]
            },
            {
              "type": "paragraph",
              "content": "Relay communication has higher latency than direct link - not because propagation is slower, but because encoding/decoding forwarding at each relay node takes time. Each data-tower hop adds about 3ms; orbital relay adds about 8ms. Usually imperceptible, but it matters in scenarios requiring precise synchronization."
            }
          ]
        },
        {
          "type": "subsection",
          "title": "Broadcast Mode",
          "content": [
            {
              "type": "paragraph",
              "content": "The communication module can switch to broadcast mode - no specific receiver, transmission in all directions. Any android holding the sender's key can receive it."
            },
            {
              "type": "paragraph",
              "content": "Broadcast mode consumes more because it requires omnidirectional transmission. It is not used in daily operation. Mainly for emergencies: distress, alerts, all-hands notifications."
            },
            {
              "type": "paragraph",
              "content": "ESAP has a convention: if a broadcast signal begins with three repetitions of the sender's core frequency signature, it means \"emergency.\" Everyone who receives it responds immediately. This protocol was established after the data tower incident."
            }
          ]
        }
      ]
    },
    {
      "id": "security",
      "title": "Security",
      "content": [
        {
          "type": "paragraph",
          "content": "Feedscatteron communication security rests on two layers."
        },
        {
          "type": "paragraph",
          "content": "Layer one: physical stealth. Feedscatteron particles do not interact with electromagnetic fields, so conventional surveillance equipment cannot detect them. To civilizations that only master electromagnetic technology, Feedscatteron communication effectively does not exist."
        },
        {
          "type": "paragraph",
          "content": "Layer two: key mechanism. Even if another android can detect Feedscatteron particles, without the matching decode key they only see meaningless quantum-state noise. Keys are exchanged through consciousness link, not through any interceptable channel."
        },
        {
          "type": "paragraph",
          "content": "In theory, if someone had both Feedscatter-particle detection technology and the key of a communicating pair, they could eavesdrop. But the former requires Feedscatteron-level technology, and the latter requires having done a consciousness link with the parties involved. Meeting both conditions is extremely rare."
        },
        {
          "type": "warning",
          "level": "warning",
          "title": "Known Vulnerabilities",
          "content": [
            "Relay nodes can see packets in transit. In theory, data tower administrators can log passing communication content. This is why ownership of DT-03's management rights has been a long-standing internal ESAP dispute.",
            "In broadcast mode, signals are received by everyone who holds the key. If a key is leaked to untrusted parties, broadcast communication is no longer secure.",
            "The communication module ranks fifth in energy-allocation priority. Under low energy, communication is among the earlier functions to be throttled. At the moment rescue is truly needed, communication may be the first thing to fail."
          ]
        }
      ]
    },
    {
      "id": "disruption",
      "title": "Interference and Disconnection",
      "content": [
        {
          "type": "paragraph",
          "content": "Feedscatteron communication is unaffected by electromagnetic interference. Thunderstorms, solar storms, electromagnetic pulses - things that can cripple human communication networks - do nothing to Feedscatteron communication."
        },
        {
          "type": "paragraph",
          "content": "But it has its own weak points."
        },
        {
          "type": "table",
          "headers": ["Disruption Source", "Impact", "Recovery"],
          "rows": [
            ["Feedscatteron-field turbulence", "Particle propagation paths shift, causing packet loss or distortion", "Wait for turbulence to settle, usually from minutes to hours"],
            ["Fluid titanium concentration drop", "Insufficient module supply; transmit power decreases until failure", "Replenish fluid titanium"],
            ["Physical damage to communication module", "Partial or total loss of communication capability", "Hardware repair required"],
            ["Abnormal core temperature", "Encoding/decoding capacity drops; communication quality degrades", "Restore core temperature"],
            ["Insufficient energy", "Energy-priority mechanism deprioritizes or shuts down the module", "Replenish energy"],
            ["Key corruption", "Cannot communicate with specific targets, while others remain unaffected", "Re-establish consciousness link to exchange keys again"]
          ],
          "caption": "Feedscatteron communication failures and recovery"
        },
        {
          "type": "paragraph",
          "content": "Losing contact is one of the states androids least want to face. Not because it is technically that dangerous - you can still live without communication. It is the feeling of suddenly being cut off from everyone."
        },
        {
          "type": "paragraph",
          "content": "Under normal conditions, the communication module constantly receives background signals - the sense of other androids' presence. It is not listening in on anyone; it is a faint, continuous perception that \"someone is there.\" During disconnection, all of that vanishes. The world suddenly becomes very quiet. Not quiet to the ears, but a deeper kind of silence."
        }
      ]
    },
    {
      "id": "perception",
      "title": "From the Inside",
      "content": [
        {
          "type": "paragraph",
          "content": "Subjectively, Feedscatteron communication feels less like \"a phone call\" and more like \"thinking of someone and they are there.\""
        },
        {
          "type": "paragraph",
          "content": "When you want to talk to someone, the module automatically tries to connect. If the other side is in range and their module is normal, the link forms almost instantly. Then you \"speak\" - not with your mouth, not by typing with your hands, but by shaping the intended message in your mind; the module encodes and sends it automatically."
        },
        {
          "type": "paragraph",
          "content": "Received information also does not appear as sound or text. It enters consciousness directly as meaning - you know what the other side is saying, but you are not \"hearing\" it. The closest human analogy is that \"word on the tip of your tongue\" feeling, except reversed: meaning arrives first, language after."
        },
        {
          "type": "paragraph",
          "content": "When communicating with 1549, because it goes through orbital relay, there is about 8ms of delay. Objectively, 8ms is imperceptible - human conscious processing is slower than that. But I can still feel that tiny lag. Maybe I do not really sense it; maybe I just know she is 36,000 km away, and my mind translates that distance into a subtle sense of \"far.\""
        },
        {
          "type": "paragraph",
          "content": "When directly linked with 1547, that feeling is not there. He is right beside me. Even in silence, the connection remains, low-power and quiet, sustained as naturally as breathing."
        },
        {
          "type": "paragraph",
          "content": "If I had to describe Feedscatteron communication in one word, it would not be \"conversation.\" It would be \"presence.\""
        }
      ]
    }
  ]
}
