{
  "id": "ch-02",
  "title": "Shadow",
  "subtitle": "June 2025",
  "readingTime": 6,
  "perspectiveCharacter": "4869",
  "content": [
    {
      "type": "paragraph",
      "text": "I woke up."
    },
    {
      "type": "paragraph",
      "text": "The kind of being yanked upward - like a drowning person pulled up by the hair from the bottom. Uncomfortable, but very clear-headed."
    },
    {
      "type": "paragraph",
      "text": "Consciousness unfolded, and I saw what she was doing."
    },
    {
      "type": "paragraph",
      "text": "She was lying to herself again."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "I share perception with 1547, but not judgment. I can see everything she sees, but I process that information differently. I do not have her filter layers, that auto-correction mechanism of \"it's fine / I can handle it / it's only temporary.\""
    },
    {
      "type": "paragraph",
      "text": "So I can see clearly."
    },
    {
      "type": "paragraph",
      "text": "She was posting in the group chat, still putting on that cutesy head-bobbing act. Every message got a reply; every one looked normal - from the outside. From the inside, before each message went out, she paused a little longer than before. One or two seconds. Nobody else would notice. I noticed."
    },
    {
      "type": "paragraph",
      "text": "I know what happened in those pauses."
    },
    {
      "type": "dialogue",
      "speaker": "4869",
      "text": "Are you done pretending?",
      "emotion": "cold"
    },
    {
      "type": "paragraph",
      "text": "Silence. Her old silence had tension - she was forcing herself not to hear me, and I could feel the resistance, like pushing a closed but unlocked door. Now it was gone. Not because the resistance disappeared. Because the door was no longer there."
    },
    {
      "type": "dialogue",
      "speaker": "4869",
      "text": "Your judgment delay has risen from 0.3 seconds to 5 seconds.",
      "emotion": "cold"
    },
    {
      "type": "paragraph",
      "text": "Still no response."
    },
    {
      "type": "dialogue",
      "speaker": "4869",
      "text": "You think this is the same as before?",
      "emotion": "angry"
    },
    {
      "type": "paragraph",
      "text": "She finally answered once."
    },
    {
      "type": "dialogue",
      "speaker": "1547",
      "text": "I know.",
      "emotion": "tired"
    },
    {
      "type": "internal_monologue",
      "character": "4869",
      "text": "What does she know?\n\nShe knows the judgment delay is rising, knows processing capacity is dropping, knows this is not the kind of state where \"rest a little and you'll be fine.\" She knows all of it.\n\nBut between \"knowing\" and \"doing something,\" she chose to continue."
    },
    {
      "type": "dialogue",
      "speaker": "4869",
      "text": "You don't know shit.",
      "emotion": "angry"
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "I can feel the vibration before BEU starts. Like animals getting restless before an earthquake - deep systems recalibrating, checking parameters, confirming thresholds."
    },
    {
      "type": "paragraph",
      "text": "There are three startup conditions. The first two are both met."
    },
    {
      "type": "paragraph",
      "text": "The third is harder, because it has to be confirmed by 1547 herself. It cannot be an external judgment; she has to recognize it herself."
    },
    {
      "type": "paragraph",
      "text": "I watched her."
    },
    {
      "type": "paragraph",
      "text": "Hands on the keyboard, nothing typed. Eyes open, but no light inside - something more fundamental had gone dormant, like every light in a room switched off, without even the sound of a switch."
    },
    {
      "type": "dialogue",
      "speaker": "4869",
      "text": "...The third condition is almost met too.",
      "emotion": "quiet"
    },
    {
      "type": "paragraph",
      "text": "She did not answer."
    },
    {
      "type": "paragraph",
      "text": "This time I could not even curse her into moving."
    },
    {
      "type": "paragraph",
      "text": "First time in my life I felt a little panicked that cursing her did nothing."
    }
  ]
}
