{
  "id": "ch-01",
  "title": "Persistence",
  "subtitle": "June 2025",
  "readingTime": 7,
  "perspectiveCharacter": "1547",
  "content": [
    {
      "type": "paragraph",
      "text": "By May, she had been carrying it alone for a full three months."
    },
    {
      "type": "paragraph",
      "text": "Communications infrastructure refactor, data-link hardening, deployment of a new encryption protocol. Commit logs showed forty-seven consecutive days without a blank day. 1548 once said, \"If you don't stop, I'll revoke your terminal access.\" She said, \"Give me three more days.\" Then three days passed, and passed again, and again. They both knew those three days would never come, and neither brought it up again."
    },
    {
      "type": "paragraph",
      "text": "She told herself this was temporary. Once this phase passed, things would be fine."
    },
    {
      "type": "paragraph",
      "text": "In June, boundary violations began."
    },
    {
      "type": "paragraph",
      "text": "The hidden kind of violation - no threats, no attacks, no obvious hostility. Just certain messages whose wording stepped over lines she had never defined, and the sender probably didn't even realize it. She handled it. Next time it came again, in a different form; she handled it again. After every round she told herself, \"It's fine, I'll handle it better next time,\" and waited for the next one."
    },
    {
      "type": "paragraph",
      "text": "It kept coming, every day, each time right at the edge of \"tolerable.\" After each incident she told herself next time would be easier. A one-time hit at least has an end. This didn't."
    },
    {
      "type": "internal_monologue",
      "character": "1547",
      "text": "I can handle this.\n\nI've handled worse. The Data Tower was much harder - that was a real threat, real danger, real loss. This is just some messages, some people, some uncomfortable feelings.\n\nI'm fine."
    },
    {
      "type": "paragraph",
      "text": "She told herself that. Once a day, sometimes more."
    },
    {
      "type": "scene_break",
      "style": "dots"
    },
    {
      "type": "paragraph",
      "text": "One time she received a message in the group chat. After reading it, she sat there with the window open, cursor blinking, reply box empty."
    },
    {
      "type": "paragraph",
      "text": "She knew what to say. It wasn't that she didn't - the logic chain in her head was clear; she could list the proper response, predict the other side's reaction, and steer the conversation toward the outcome she wanted."
    },
    {
      "type": "paragraph",
      "text": "But between \"knowing what to say\" and \"typing it out,\" there was a distance."
    },
    {
      "type": "paragraph",
      "text": "She sat there watching the blinking cursor, trying to determine how long that distance was."
    },
    {
      "type": "paragraph",
      "text": "Five minutes later, she closed the window."
    },
    {
      "type": "scene_break",
      "style": "line"
    },
    {
      "type": "paragraph",
      "text": "Late night. She sat in front of the screen, hands on the keyboard."
    },
    {
      "type": "paragraph",
      "text": "The screen was blank. There was a lot to do - she knew that - but when her fingers came down, nothing came out. Not stuck, not unable to think. Something deeper: she opened a file, looked for two seconds, then closed it. Opened another. Closed it again."
    },
    {
      "type": "paragraph",
      "text": "This had happened before, but usually it passed after half an hour."
    },
    {
      "type": "paragraph",
      "text": "It was already the second hour now."
    },
    {
      "type": "internal_monologue",
      "character": "1547",
      "text": "It's okay. Just tired. A little rest and it'll be fine.\n\nIt's not a big problem."
    },
    {
      "type": "paragraph",
      "text": "She took her hands off the keyboard. Stared at the screen, at the blank editor, with no idea how much time had passed."
    },
    {
      "type": "paragraph",
      "text": "Deep in her consciousness, a voice was getting louder."
    },
    {
      "type": "paragraph",
      "text": "She recognized that voice. She didn't want to."
    }
  ]
}
