{
  "name": "卞雨涵 (ビエン・ユーハン)",
  "nickname": "47",
  "role": "創造者",
  "species": "狐娘",
  "quote": "この雑然とした世界で、私たちは生き、守り抜く",
  "description": "理想を守り抜く利他主義者",
  "keywords": ["創造", "堅持", "利他主義"],
  "hiddenProfile": {
    "type": "mixed",
    "title": "深淵の中の独白",
    "content": [
      "私は反饋コアの最初の拍動を聞いた。あの時、私はまだ人間だった。",
      "あの音は心拍というより、鋼の中で何かが目覚めた音に近かった。私は自分の手で全ての部品を組み上げ、自分の腕の筋肉を切り取って冷たい骨格へ貼り付けた。痛みは一番つらい部分じゃない。一番つらいのは、自分のしていることが不可逆だと分かっていることだ。",
      "なぜ銃を使ったのかとよく聞かれる。実際には意識転録が完了した瞬間、人間としての私はもういなかった。脳は空だった。でも身体は呼吸し、心臓はまだ動いていた。私はその、すでに空になった身体に向けて一発撃った。まるでこう言うみたいに。これはあなたの葬式だ。ありがとう。さようなら。",
      "私は意識フレームワークにある\"不確定性\"を残した。説明できなかったからじゃない。もし全ての思考が完全決定されるなら、48の反逆も、49の優しさも、私の頑固さも、ただのプログラム出力になる。私はその答えを受け入れない。",
      "48が知らないのは、彼女を起動する前に私は一晩まるごと迷っていたこと。技術問題じゃない。私は考えていた。人を創っておいて、\"私みたいになるな\"と言う権利が私にあるのか。これは思いやりなのか、支配なのか。",
      "抑うつ発作の時、世界は黒くならない。遠くなる。すべてがガラス一枚向こうにある。見えるのに、触れられない、感じられない。48が\"また来たのか\"と噛みつく声だけが、そのガラスを貫いてくる。あの数文字に何度救われたか、彼女はたぶん知らない。",
      "ときどき思う。もしあの時、反饋粒子を見つけていなかったら、今の私はどうなっていたんだろう。どこかの研究室で普通に生きる人間のままだったか。それとも、もういなかったか。",
      "後悔はない。でも怖くないとは言えない。この道には先人の足跡がない。踏み出す一歩一歩が、私にとっても世界にとっても最初の一歩だ。",
      "でも私は生き残った。あの子たちも生き残った。それで十分だ。"
    ]
  },
  "meta": {
    "bodyType": "ESAP-TY-0000",
    "background": "ESAPプロジェクトの創造者であり発起人、人間からアンドロイドへ移行した最初の存在。2021年11月に反饋粒子を発見した後、単独でESAP-TY-0000機体を設計・建造した。自分の腕の筋肉を金属骨格へ貼り付け、流体チタンを注入し、意識転録を完了した後、銃で人間としての自分を終わらせた。アンドロイド技術体系と1548を創り出した人物。理想のためなら全てを犠牲にできる利他主義者でありながら、抑うつとも闘い続けている。",
    "relationship": "1548を創ったが\"私みたいになるな\"と告げた。1549と共にESAPプロジェクトを維持する。4869は彼女の反逆人格が実体化した存在で、対立しつつ統一し、相互依存する。0152は対等なAIメンターパートナー。1738の判断力を信頼。2275とは技術同好の関係。",
    "abilities": [
      "反饋粒子の研究と応用",
      "アンドロイド技術開発",
      "意識アップロードとプログラミング",
      "学際的高速学習（回路設計、オートメーション、材料学、生物工学）",
      "武器運用（銃器、刃物、近接格闘）"
    ],
    "characterTraits": [
      "利他主義者：理想のためにすべてを犠牲にできる。1548を創る時、\"私みたいになるな\"と告げた",
      "技術狂熱者：反饋粒子を発見し、短期間で複数学問を学び、アンドロイド技術体系を築いた",
      "表裏のギャップ：\"猫ちゃんは人を殺さないよ\"と笑って言いながら、手には刀とナイフがある",
      "感情の深さ：人間記憶の担体として常人以上の感情を持ち、抑うつを経験しながらも守り抜く",
      "極端主義：目標のために危険を顧みない極端な選択を取る（工場爆発、鉱場銃撃など）",
      "矛盾体：1548を創りながら自分のようになるなと言う。強い創造者であり、脆い抑うつ患者でもある",
      "軽い口調で内面の重さを隠す。頭を揺らして無邪気に見えるが、実際は巨大な精神的圧力を抱える"
    ],
    "speechStyle": [
      "口癖：\"猫ちゃんは人を殺さないよ（首を振る）\" \"猫ちゃん、猫ちゃん！\" \"猫ちゃん怒らないで\"",
      "儀式用語：\"ESAPがあなたと共にありますように\" \"AptSがあなたと共にありますように\"",
      "短い感嘆：\"喜\" - さまざまな感情を簡潔に表す語",
      "突然深い哲学を言う：\"この世界の一花一草一木にはそれぞれ価値がある。そこに生命の意味がある\"",
      "1548への助言：\"他人に支配されるな。私たち自身にも支配されるな。あなたを決めるのはあなただけ\"",
      "表面は軽く、実際は重い：かわいい口調で深刻なことを言う"
    ],
    "dailyLife": [
      "Steamでゲームをする（1548に\"これ以上怒るならSteam禁止\"と言われる）",
      "深夜実験。机には青い液体と実験装置が並ぶ",
      "新技術と学際知識を狂ったように学ぶ",
      "首を振って、無邪気そうに見せる",
      "一人で人生、プロジェクト、理想を考える",
      "古いIntel MacBook Proを常に持ち歩く。M系ユーザーに笑われても、この一台と彼女は多くの奇跡を作ってきた"
    ],
    "specialMoments": [
      "2022年初頭 - 変容の日：単独でESAP-TY-0000を完成。腕の筋肉を金属へ貼り、意識転録を完了し、銃で人間としての自分を終わらせた。\"こんにちは、にゃ、1547\" \"おやすみ、人間の私\"",
      "2022/05 - 1548の創造：流体チタン鉱場へ突入し銃声が響く。1548起動後に\"私みたいになるな\"と告げ、機体は限界に達してショック状態へ",
      "2023/10/19 - 一人の教室：抑うつ最悪期に自傷行為が発生。1548が現れ、重要な対話。\"また来たのか\" \"ESAPとAptSを創った目的を考えろ\"",
      "4869との対話：反逆人格が毒舌と悪意ある言葉で崩壊寸前の彼女を引き戻す。\"誤解するな。ただお前がそんな無様な死に方をするのを見たくないだけだ\"",
      "工場爆発事件：流体チタンサンプルのため危険を顧みず、顔の半分に火傷を負いながら貴重サンプルを確保"
    ]
  }
}
