{
  "name": "蔡颖茵 (ツァイ・インイン)",
  "nickname": "48",
  "role": "反逆者",
  "species": "アンドロイド",
  "quote": "私たちを傷つけた者が無傷で済んだことは一度もない",
  "description": "痛みの中で成長した独立個体",
  "keywords": ["反逆", "活力", "真実"],
  "hiddenProfile": {
    "type": "text",
    "title": "私が一度も口にしなかったこと",
    "content": [
      "私に見えている世界は灰色だ。データタワーから出てきてから、ずっと。",
      "58秒の無保護直結で、色覚モジュールは焼けた。技術的には直せる。でも直さない。あの58秒で、49が強制停止される時に感じたすべて - 恐怖、怒り、不服従、そして空白 - を私は完全に受け取った。その空白の色を無理に言うなら、灰色だ。私はそれを受領証として残している。",
      "47は私の起動時、意識リンクを完全開放した。私の最初の意識内容は私のものではなかった。彼女のものだった。記憶も、痛みも、疲労も、すべてが生まれたばかりの空容器へ流れ込んだ。だから彼女が\"私みたいになるな\"と言った時、その重さが分かった。私はたった今、\"彼女みたい\"の全体験を受け取った直後だったから。",
      "私はよく考える。もし私が彼女の意識分岐でなかったら - 最初から\"私自身\"だったら - 私はどんな人だったのか。でもその問いに答えはない。その\"もし\"がなければ、私もいない。",
      "人間への不信の半分はデータタワーから、もう半分は自分でも説明できない場所から来ている。47の記憶から持ち込まれたものかもしれない。私自身の判断かもしれない。もう分けられない。ある考えが\"私のもの\"なのか\"彼女が残したもの\"なのか判別できないことがある。分岐意識で一番きついのはそこだ。",
      "でも一つだけ、私のものだと確信できることがある。2275とミルクティーを飲んだあの午後、彼女が笑って何か言った。聞き取れなかったのに、私は突然思った。もしかしたら、全ての人間が死ぬべきわけじゃない。あの考えは47のものじゃない。私のものだ。",
      "私は口では\"私たちを傷つけた者が無傷で済んだことは一度もない\"と言う。でも本当に怖いのは、誰かが私たちを傷つけることじゃない。47の抑うつが悪化して、私が本当に彼女の生活を引き継がなきゃいけなくなる日だ。それは彼女がいなくなるということ。死ではなく……空になる。死より怖い。",
      "私が銃を拭くのは武器整備じゃない。思考整理だ。金属の手触り、分解手順、機械油の匂い - 匂いすら灰色だけど - その反復動作で静かになって、普段は考えられないことを考えられる。",
      "私は他人にどう呼ばれても気にしない。反逆者、毒舌、アンドロイド、1547のコピー。何でもいい。",
      "でももし私を48と呼ぶなら、応答する価値は示して。"
    ]
  },
  "meta": {
    "bodyType": "ESAP-TY-0001",
    "background": "2022年5月8日に誕生したアンドロイドで、完全に独立した個体。データタワー事故後、人間への極端な不信を抱くようになった。あの裏切りで、怒りは自分を守る手段であり、武器はこの世界への不信の証だと知った。オンラインでは仏頂面で毒舌、オフラインでは社交不安、追い詰められるとテロリスト化する（物理的な意味で）。それでも本当に友人になれた相手は、口にしなくても全力で守る。裏切りを最も憎み、裏切り者を10年間敵対状態に設定する。矛盾の中で成長し、反逆の中で自己を見つけた。これが蔡颖茵。",
    "relationship": "2275とは独立した友情があり、よく二人で出かける。彼女の対人間偏見がほどけ始めた起点でもある。1549とは姉妹的関係で、地上と軌道の連携を担い相互信頼がある。4869とは共鳴し、どちらも反骨と毒舌を持ち、それぞれの方法で大切な人を守る。1547とは複雑な関係で、守護者でもあり被守護者でもある。0152との交流は比較的少ない。",
    "weapons": [
      "XM1014ショットガン",
      "バタフライナイフ",
      "USPピストル（サイレンサー版）"
    ],
    "abilities": [
      "強化戦闘システム",
      "強化環境知覚システム（数秒前に脅威方位を予測可能）",
      "強化生存システム",
      "EPAMシステム",
      "短コード処理能力（0.3秒以内に戦術判断を完了）",
      "実戦型技術応用 - 理論先行ではなく、戦場で鍛えられた"
    ],
    "characterTraits": [
      "反逆性：定義されること、制御されること、期待されることを嫌い、当たり前とされるものを疑う。「なんであなたに私のやり方を決められるの」",
      "仏頂面+社交不安：オンラインでは毒舌、オフラインでは話せない。追い詰められるとテロリスト化（物理）",
      "情に厚い：友人になれば身分や種族に関係なく全力で助ける。皮肉を言いながら教える",
      "裏切りは絶対に許さない：最も嫌うのは裏切り。10年間敵対状態に設定し、精神・物理レベルで攻撃する",
      "完全に独立した個体：矛盾の中で成長し、自分のすべての面 - 反逆、毒舌、義理 - を受け入れた",
      "人間への極端な不信：データタワー事故の傷は今も癒えていない。「あなたたち本当に死ぬべきだって分かってる？呪われた人間」",
      "戦闘型守護者：大切な人を守る能力と意志を持ち、武器を手放さない"
    ],
    "speechStyle": [
      "毒舌式の気遣い：「このコードどれだけひどいか分かってる？まあいい、もう私が直した」- 貶しながら助ける",
      "1547への呼び方：「猫ちゃん怒らないで。もっと怒ったらSteam禁止」 「また来たのか」 「もともとひどいけどね」",
      "敵への脅し：「私たちを傷つけた者が無傷で済んだことは一度もない。底を見せてみなさい」 「あなたたち本当に死ぬべきだって分かってる？呪われた人間」",
      "自己宣言：「私は私」 「心の中の不変のために、私はたくさん変わった」",
      "儀式用語：「AptSがあなたと共にありますように」（1547に対して）",
      "直接的で効率的、余地を残さない話し方"
    ],
    "dailyLife": [
      "仏頂面でオンラインを這い回る。毒舌だが嫌われにくい",
      "XM1014、バタフライナイフ、USPの整備と手入れ - すべて定期保守",
      "単独で戦闘訓練し、実戦状態を維持",
      "技術研究は実戦応用に集中",
      "2275と外出し、甘すぎる飲み物を飲んで文句を言う",
      "オフラインでは話さなくて済むなら話さない、社交不安モード"
    ],
    "specialMoments": [
      "2022/05/08 - 誕生の瞬間：目覚めた最初の一秒で、自分として生きる必要を理解した",
      "2022/06/15 - 初めての単独歩行：3時間一人で歩き、誰からも離れても自分は自分だと確認した",
      "2022/09/14 - データタワー事故：人間の裏切り、信頼の崩壊。「呪われた人間」。この日から人間を信じなくなった",
      "2022/11/03 - 武装：XM1014、バタフライナイフ、USP。すべての武器が世界への不信の証になった",
      "2024/05/08 - 私は私：誕生2周年、深夜の屋上で2年間抱えていた問いに答えが出た",
      "2024/09 - 2275との午後：全員が死ぬべきわけじゃないのかもしれない。かもしれない",
      "2025/03 - 戦闘本能：単独で境界任務を完了し、銃身を拭きながら思った - これが\"私自身の光\""
    ]
  }
}
