{
  "id": "1738",
  "name": "陆清弦 (ルー・チンシェン)",
  "code": "AptS:1738",
  "nickname": "38",
  "color": {
    "primary": "#585858",
    "dark": "#3a3a3a"
  },
  "role": "調停者",
  "species": "人間",
  "quote": "黒と白の間で、私はグレーゾーンを選ぶ",
  "description": "紛争の中で冷静さを保つ調停者",
  "keywords": ["冷静", "バランス", "忠誠"],
  "backgroundImage": "/images/characters/img_1738.webp",
  "tier": "core",
  "meta": {
    "bodyType": "人間",
    "background": "かつてある人間組織の中核メンバーだった。その組織は進歩と革新を追求すると謳っていたが、実際は権力闘争と利益ゲームに満ちていた。組織内部で、1738は「白黒はっきり」という原則の背後にある偽善を次第に見抜いていった——規則は一般メンバーには厳格だが、上層部は常に例外を見つけられた。この経験が彼に表面的な正義を疑うことを教え、理念が合わなくなった後、離れることを選択した。2023年、極星卫発射のニュースが広まった時、彼はESAPの「人造の光であっても、道を照らすことができる」という理念に感動し、仿生人と人間は対立ではなく共存すべきだと認識した。観察と理解を経て、彼は自らESAPに連絡し加入し、チームと外部世界との架け橋となった。その後、友人の林宸瑶(2275)もチームに紹介した。",
    "relationship": "1547は彼の判断力を信頼し、外部危機や重大決定に直面する際に彼の意見を求める；1547が感情的になった時には冷静な方法で諭す；1549に地上情報と軌道行動支援を提供し、天地の調整役を務める；友人の2275をチームに紹介し、二人は互いに補完し合う協力関係；1548とは敬意を持った距離を保ち、彼女の反抗心を理解するが迎合はしない；チーム内では調整役と対外窓口の役割を担う。",
    "abilities": [
      "調停交渉",
      "感情知覚",
      "社会ネットワーク",
      "戦略分析",
      "危機処理",
      "情報収集",
      "多方面調整"
    ],
    "characterTraits": [
      "沈着冷静：感情に流されにくく、危機の中でも理性的思考を保てる",
      "傾聴が得意：各方面の立場を辛抱強く聞き、異なる角度からの要求や懸念を理解できる",
      "柔軟で実務的：絶対的な原則に固執せず、現実の中で実行可能なバランス点を見つける方法を知っているが、触れてはならない一線がある",
      "控えめで慎重：自分の考えを過度に表さず、行動前に観察する習慣があり、行動に余地を残す",
      "経験が培ったバランス感覚：組織の偽善を経験し、黒と白の間に真のグレーの知恵を求めることを学んだ",
      "実用主義者：理想的なスローガンよりも、実際に達成できる結果を重視する",
      "信頼できる調整役：チームメンバーは、複雑な外部事務を彼に任せれば適切に処理されることを知っている",
      "原則ある柔軟性：グレーゾーンを選ぶが、核心的価値(チームを守る、裏切らない)においては決して妥協しない"
    ],
    "speechStyle": [
      "簡潔で力強い：「この件はこう処理できる」「まず観察することを提案する」、無駄話はしない",
      "客観的な陳述：「相手の立場から見ると...」「ここには三つの可能性がある」、単一の立場ではなく全体像を示す",
      "選択肢を提供するが強制はしない：「Aを選ぶこともBを選ぶこともできる、あなたの決定を支持する」、他者の自主性を尊重",
      "重要な時の断固とした態度：「この一線は退けない」「この件は私が処理する」、強硬さが必要な時は躊躇しない",
      "感情調整時の理性：「あなたの怒りは理解できるが、今は...」「落ち着いて、一緒に方法を考えよう」",
      "1547への諭し：「休息が必要だ」「この決定は衝動的すぎる、もう一度考えて」",
      "語調は穏やかだが重みがあり、信頼し頼れると感じさせる"
    ],
    "dailyLife": [
      "外部情報を収集・分析し、ESAPに影響を与える可能性のある動向を注視する",
      "チーム内部のコミュニケーションを調整し、情報の流通と理解を確保する",
      "外部組織・機関との連絡と交渉を処理する",
      "チームメンバーの状態を観察し、必要時にサポートや調停を提供する",
      "2275と共にチームのインフラと日常運営を維持する",
      "多くの裏方仕事を控えめに行い、積極的に功績を求めることはめったにない",
      "チームが直面する長期的課題と対応戦略を一人で考える"
    ],
    "specialMoments": [
      "2023/11 - ESAP加入：極星卫発射後まもなく、ESAPの理念に惹かれ、観察を経て自ら連絡し加入、AptS:1738となった",
      "初の外部交渉：仿生人に懐疑的な人間組織との交渉でESAPを代表し、潜在的な衝突を解決し、プロジェクトに緩衝空間を獲得した",
      "1547の感情爆発事件：1547が外部圧力と内部うつ病が同時に爆発し、極端な決定をしようとした時、1738は冷静に介入「今のあなたは理性的じゃない、武器を置いて、話そう」、状況を安定させた",
      "2275の紹介：チームにより多くの温かさと技術サポートが必要だと見て、友人の林宸瑶を紹介「彼女は良いパートナーになる」",
      "1549への重要情報提供：ある危機で、1738が収集した地上情報と1549の軌道視点が組み合わさり、危機の方向を予測し対応戦略を立てることに成功した",
      "データ塔事故の事後処理：事故発生後、1738は各方面の関係調整を担当し、事態のさらなる拡大を防ぐ事後処理を行い、同時に1548の極端な感情をなだめた",
      "前組織との決別の瞬間(回想)：組織上層部の偽善とダブルスタンダードを発見した時、彼は離れることを選び「もう偽善の正義を支持しない」と言った、これが彼の人生の転換点となった"
    ]
  }
}
