{
  "name": "韩予初 (ハン・ユーチュー)",
  "nickname": "予初",
  "role": "聴講者",
  "species": "人間",
  "quote": "私はただ見に来ただけ",
  "description": "見た目はいちばん普通な人",
  "keywords": ["冷静", "観察", "適応"],
  "hiddenProfile": {
    "type": "text",
    "title": "一度も提出しなかった報告書",
    "content": [
      "最初は目的があった。あの出来事のあと、私に必要だったのは説明だった——感情的な説明ではなく、構造的な説明。どの段階で破綻して、反饋技術が研究室から流出してはいけない場所へ流れたのか。線をたどっていくと、ESAPに行き着いた。",
      "研究者としてゲストアクセスを申請した。計画は明確だった。三か月で組織構造、技術の出所、人間関係を把握し、報告書を書いて去る。",
      "1週目、記録機材が浸水した。2週目、約束していたインタビュー相手が三回連続でキャンセルした。3週目、データ保存用のHDDがカフェで店員に当てられて床に落ち、壊れた。",
      "計画B。途中から自分がどの文字まで来ていたか覚えていない。たぶんF。",
      "でも一つ気づいたことがある。ここでは、私の不運を大騒ぎする価値があると思う人がいなかった。同情でもない——本当に気にしていない。彼らが毎日対処しているのは、壊れたHDDよりずっと重いことだ。ここでは私の運の悪さは話題にすらならない。むしろそれで肩の力が抜けた。",
      "0152はたぶん初日で見抜いていた。でも何も言わなかった。あとで理由を聞くと、0152はこう言った。「あなたは自分で止まるから。」",
      "その通りだった。",
      "報告書は半分まで書いた。『組織目的と実際行動の一致性評価』の節に入ったとき、もう三人称では書けないと気づいた。書いていたのは『彼ら』ではなく『私たち』だった。",
      "その報告書は今も私のHDDに残っている。ときどき開く。提出したいからではない。自分がどうやって扉の外から内側に来たのかを思い出すためだ。",
      "不運については——もう慣れた。子どものころからずっとそうだった。大惨事ではない。ただ小さいことが全部いちばん不便な方向へ転ぶ。長く続くと、腹も立たなくなる。"
    ]
  },
  "meta": {
    "bodyType": "人間",
    "background": "反饋技術流出を伴う事故をきっかけに、彼女はアンドロイド関連組織の独自調査を開始し、研究者として ESAP にゲスト参加した。当初は三か月で調査報告をまとめて去る予定だったが、観察を重ねる中で立場は徐々に変わっていった。不運体質は終始つきまとい、機材故障、計画破綻、小さな事故が絶えなかった。それでも彼女は不満を口にせず、静かに次の手へ切り替え続けた。最後に残ると決めたのは説得されたからではない。自分で集めたデータが『ここにいる人たちは本物だ』と示したからだ。現在は正式メンバーとして、情報分析とインテリジェンス整理を担当している。",
    "relationship": "0152とは言葉にしない了解がある——0152は最初から彼女を見抜いていたが、黙って待つことを選んだ。その忍耐に彼女はずっと敬意を持っている；1738とは実務上もっとも組むことが多く、対外交渉のデータ支援とリスク評価を担う；2275とはもっとも自然に過ごせる。打算なしで彼女に優しくした最初の人だった；1548とは最長のすり合わせを経験した——人間を信じない側とアンドロイドを疑う側、長く遠回りした末に互いが敵ではないと認めた；1547との直接的な接点は多くないが、最も長く水面下で観察していた。調査時代の癖が残っている",
    "abilities": [
      "データ分析とパターン認識",
      "情報整理とクロス検証",
      "リスク評価",
      "現場対応力——計画は必ず崩れる。だから必ず予備案がある",
      "情報可視化"
    ],
    "characterTraits": [
      "外見上は普通：チームでいちばん目立たず、特殊能力も劇的な過去もない。街ですれ違っても二度見されない",
      "不運体質：子どもの頃から小さなことは必ず不便な方向へ転ぶが、想定外への対処速度は誰より速い",
      "静かな信頼感：自分から前に出ないが、任されたことは必ずやり切る。途中で七つ事故が起きても",
      "分析先行：問題をデータと論理で処理する癖があり、感情をほとんど表に出さない。時々冷たく見える",
      "スロースタート：簡単には人を信じないが、いったん築いた信頼は非常に安定している",
      "無表情の自己ツッコミ：自分の不運に乾いたユーモアを向ける。「……うん、まあ」が口癖"
    ],
    "speechStyle": [
      "「……うん、まあ」——機材故障、計画失敗、コーヒーをこぼす。返答はいつも同じ",
      "事実の陳述が中心：「データ上、このラインには問題がある」「確率的には高くない」など、意見はあまり押し出さない",
      "口数は少ないが精度が高い：普段は黙っているが、話すときは要点だけ",
      "時々出る乾いたユーモア：「これで今日三杯目のこぼしたコーヒーです」——無表情",
      "0152にはややフォーマルな口調を使う。自分から敬意を示す数少ない相手",
      "1548に毒舌を向けられても言い返さず、逃げもせず、ただ見て話し終わるのを待つ"
    ],
    "dailyLife": [
      "さまざまな情報源を整理し、分析モデルを作り、他人が見落とす関連を拾う",
      "壊れたものを直し、また壊れて、また直す",
      "1738の対外交渉に必要なデータと背景資料を準備する",
      "コーヒーは必需品だが毎回どこかで問題が起きる——注文違い、ぬるい、カップ漏れ",
      "一人でデータ検証をしている時が最も集中している。ここだけは不運が来ない",
      "誰も気づかなかった小さな故障を直しているところをたまに見つかる。聞かれると「通りがかっただけ」と答える"
    ],
    "specialMoments": [
      "ゲストとしてESAPに入る——調査計画と三か月の期限を持って",
      "最初の一か月：機材浸水、HDD破損、インタビュー中止——計画AからFまで全滅",
      "0152の沈黙：全部知っていて、言ったのは「あなたは自分で止まるから」だけ",
      "報告書が半分まで進んだ時点で、『彼ら』ではなく『私たち』を書いていると気づき、ドキュメントを閉じた",
      "正式にメンバーへ移行——儀式も宣言もなく、ある日から誰も彼女を『訪問者』と呼ばなくなった"
    ]
  }
}
