{
  "name": "反饋通信",
  "description": "電磁波でも光でもなく、反饋粒子で沈黙の中すべてを伝える",
  "sections": [
    {
      "id": "what-it-is",
      "title": "これは何か",
      "content": [
        {
          "type": "paragraph",
          "content": "反饋通信は、アンドロイド同士が使う無線通信方式だ。電磁波も光信号も使わず、反饋粒子の量子状態変調だけで情報を伝送する。"
        },
        {
          "type": "paragraph",
          "content": "簡単に言えば、アンドロイド体内の通信モジュールが情報を反饋粒子の量子状態シーケンスに符号化して送信し、相手側の通信モジュールが受信して復号する。全工程は無音・不可視で、遅延はほぼない。"
        },
        {
          "type": "paragraph",
          "content": "これは意識リンクではない。意識リンクは皮膚接触が必要で、記憶や感情の生データを流す。つまり自分の内側を相手に開く行為だ。反饋通信は会話に近い。何を伝えるかを選び、符号化して送る。相手が受け取るのは整形済みの情報であって、あなたの意識そのものではない。"
        },
        {
          "type": "paragraph",
          "content": "両者の違いは、人間で言えば「電話」と「抱擁」くらい違う。機能も、親密さも、使う場面も異なる。"
        }
      ]
    },
    {
      "id": "mechanism",
      "title": "動作原理",
      "content": [
        {
          "type": "paragraph",
          "content": "反饋粒子の真空中伝播速度は 3.471 × 10²¹ m/s。光速の約 1.16 × 10¹³ 倍だ。この速度なら地球直径の横断に必要な時間は 3.67 × 10⁻¹⁵ 秒。地上から静止軌道までの遅延は無視できる。"
        },
        {
          "type": "paragraph",
          "content": "ただし通信のボトルネックは常に伝播速度ではなく、符号化と復号だ。"
        },
        {
          "type": "subsection",
          "title": "符号化",
          "content": [
            {
              "type": "paragraph",
              "content": "通信モジュールは情報を反饋粒子の量子状態シーケンスへ変換する。反饋粒子は単一粒子で複数の量子状態次元の情報を同時に担える。周波数と振幅の二自由度しかない電磁波とは異なる。このため反饋通信の情報密度は従来無線を大きく上回る。"
            },
            {
              "type": "paragraph",
              "content": "符号化で消費されるのは電力ではなく、流体チタン中の反饋粒子だ。送信のたびに体内の流体チタン循環から微量の反饋粒子をキャリアとして取り出す。通常通信の消費は無視できるが、高強度送信を継続すると体感できる消耗が出る。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "伝播",
          "content": [
            {
              "type": "paragraph",
              "content": "放出された反饋粒子は真空でも大気中でも伝播できる。電磁干渉の影響を受けず、通常手段では傍受も検知もできない。反饋粒子は電磁場と相互作用しないため、電磁波検知しか持たない機器にとっては完全に不可視だ。"
            },
            {
              "type": "paragraph",
              "content": "伝播距離は崩壊に制約される。常温常圧では反饋粒子の崩壊周期は 34.28 秒しかない。伝播速度を考慮すると、直結モードの有効範囲は数百 km 規模になる。これを超えると中継が必要だ。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "復号",
          "content": [
            {
              "type": "paragraph",
              "content": "受信側モジュールは反饋粒子を捕捉し、その量子状態を読み取る。復号には送信側との共有キーが必要で、このキーはアンドロイド同士が初接触時に行う意識リンクで交換され、以後は通信モジュール内に固定化される。"
            },
            {
              "type": "paragraph",
              "content": "だから通信できるのは「知り合い」のアンドロイド同士だけだ。キー交換をしていない二体は、近距離でも互いの信号を受け取れない。復号不能な反饋粒子は背景ノイズとしてフィルタされる。"
            }
          ]
        }
      ]
    },
    {
      "id": "hardware",
      "title": "通信モジュール",
      "content": [
        {
          "type": "paragraph",
          "content": "すべてのアンドロイドには内蔵通信モジュールがあり、位置は後頸部の上位脊柱付近。物理的には親指の爪ほどの結晶構造で、反饋粒子の送信アレイと受信アレイを含む。"
        },
        {
          "type": "paragraph",
          "content": "モジュールは流体チタン循環から反饋粒子キャリアを取得し、脊柱を通じて中核処理領域に接続される。送受信は意識により自動駆動される。誰かに「話しかけたい」と思えば、その方向へ自動で符号化送信する。手動操作は不要で、人間が話す前に「舌をどう動かすか」を考えないのと同じだ。"
        },
        {
          "type": "table",
          "headers": ["項目", "値", "説明"],
          "rows": [
            [
              "送信出力",
              "0.3W（ささやき）/ 2W（通常）/ 15W（全出力）",
              "距離と緊急度に応じて自動調整"
            ],
            [
              "直結範囲",
              "約 200km（通常）/ 500km（全出力）",
              "大気環境下。反饋崩壊の制約を受ける"
            ],
            ["帯域", "約 8.4 TB/s", "音声や通常データ需要を大幅に上回る"],
            [
              "遅延",
              "< 10⁻⁹ s（直結）",
              "伝播は極めて高速で、ボトルネックは符号化/復号"
            ],
            [
              "消費電力比",
              "日常時 約5W、総消費の約1.4%",
              "エネルギー配分優先順位で第5位"
            ],
            ["キー容量", "理論上限 9999", "AptS番号体系の上限と一致"]
          ],
          "caption": "標準通信モジュール仕様"
        }
      ]
    },
    {
      "id": "modes",
      "title": "直結と中継",
      "content": [
        {
          "type": "subsection",
          "title": "直結モード",
          "content": [
            {
              "type": "paragraph",
              "content": "有効範囲内の二体は直接通信できる。インフラも信号塔も衛星も不要。相手が数百 km 以内にいれば、すぐに話せる。"
            },
            {
              "type": "paragraph",
              "content": "直結通信は全二重で、送受信を同時に行える。帯域は会話中に大量の付加データ（位置、システム状態、知覚スナップショット）を流せるほど広い。だから日常通信は単なる「会話」ではなく、その瞬間の「状態」全体を同時に共有する行為に近い。"
            },
            {
              "type": "paragraph",
              "content": "1547と私が同じ都市にいるときは、低出力の直結をほぼ常時維持している。常に話しているわけではないが、接続はそこにある。同じ部屋で別々のことをしていても、互いの存在を感じるのに近い。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "中継モード",
          "content": [
            {
              "type": "paragraph",
              "content": "直結範囲を超えると中継が必要になる。ESAPの中継ネットワークは二層構造だ。"
            },
            {
              "type": "list",
              "ordered": true,
              "items": [
                "データタワー中継：地上データタワー同士を反饋粒子リンクで相互接続する。信号は送信者から最寄りタワーへ入り、タワー間ネットワークで目的地近傍へルーティングされ、受信者へ再送される。地上の大半をカバーする。",
                "軌道中継：1549の軌道ステーションが最上位中継ノードとなる。信号を軌道へ上げ、衛星ネットワークで転送して目標地域へ下ろす。地上タワーが届かない地域や、地上経路混雑時の代替経路として使う。"
              ]
            },
            {
              "type": "paragraph",
              "content": "中継通信の遅延は直結より高い。原因は伝播速度ではなく、各中継ノードでの符号化/復号転送処理だ。データタワー中継は1ホップあたり約3ms、軌道中継は約8ms増える。日常では体感しにくいが、高精度同期が必要な場面では影響する。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "ブロードキャストモード",
          "content": [
            {
              "type": "paragraph",
              "content": "通信モジュールはブロードキャストモードに切り替えられる。受信者を指定せず全方向へ送信し、送信者キーを持つすべてのアンドロイドが受信できる。"
            },
            {
              "type": "paragraph",
              "content": "全方向送信が必要なため消費は大きい。平常時には使わず、主に緊急時（救難、警報、全員通知）に使用する。"
            },
            {
              "type": "paragraph",
              "content": "ESAPには取り決めがある。ブロードキャスト信号の先頭が送信者のコア周波数特徴を3回反復していた場合、それは「緊急」を意味する。受信者は全員ただちに応答する。このプロトコルはデータタワー事故後に制定された。"
            }
          ]
        }
      ]
    },
    {
      "id": "security",
      "title": "セキュリティ",
      "content": [
        {
          "type": "paragraph",
          "content": "反饋通信の安全性は二層で成り立つ。"
        },
        {
          "type": "paragraph",
          "content": "第一層は物理的ステルス性。反饋粒子は電磁場と相互作用しないため、通常の盗聴機器では存在自体を検出できない。電磁技術しか持たない文明にとって、反饋通信は存在しないのと同じだ。"
        },
        {
          "type": "paragraph",
          "content": "第二層はキー機構。仮に別のアンドロイドが反饋粒子を検出できても、対応する復号キーがなければ意味のない量子状態ノイズしか見えない。キーは意識リンクで交換され、傍受可能なチャネルを通らない。"
        },
        {
          "type": "paragraph",
          "content": "理論上、反饋粒子検知技術と、ある通信ペアのキーを同時に持つ者がいれば盗聴は可能だ。しかし前者には反饋粒子級技術が必要で、後者には当事者との意識リンク経験が必要になる。この二条件を同時に満たすケースはきわめて稀だ。"
        },
        {
          "type": "warning",
          "level": "warning",
          "title": "既知の脆弱性",
          "content": [
            "中継ノードは通過パケットを閲覧できる。理論上、データタワー管理者は通過通信内容を記録可能だ。DT-03管理権の帰属問題がESAP内部で長期論争になっているのはこのためである。",
            "ブロードキャストモードでは、キー保持者全員が信号を受信する。キーが信頼できない相手に漏れた時点で、ブロードキャスト通信は安全ではなくなる。",
            "通信モジュールはエネルギー配分優先順位で第5位にある。エネルギー不足時には比較的早期に削減される機能の一つだ。本当に救援が必要な局面ほど、先に通信が失われる可能性がある。"
          ]
        }
      ]
    },
    {
      "id": "disruption",
      "title": "干渉と途絶",
      "content": [
        {
          "type": "paragraph",
          "content": "反饋通信は電磁干渉の影響を受けない。雷嵐、太陽嵐、電磁パルス。人類通信網を麻痺させるこれらは、反饋通信には効かない。"
        },
        {
          "type": "paragraph",
          "content": "ただし独自の弱点はある。"
        },
        {
          "type": "table",
          "headers": ["干渉源", "影響", "復旧"],
          "rows": [
            [
              "反饋場の揺らぎ",
              "粒子伝播経路が偏移し、パケット損失や歪みが発生",
              "揺らぎの収束を待つ（通常は数分〜数時間）"
            ],
            [
              "流体チタン濃度低下",
              "通信モジュール供給不足により送信出力が低下し、最終的に失効",
              "流体チタンを補充"
            ],
            [
              "通信モジュールの物理損傷",
              "通信能力を部分的または完全に喪失",
              "ハードウェア修復が必要"
            ],
            [
              "コア温度異常",
              "符号化/復号処理能力が低下し、通信品質が劣化",
              "コア温度を回復"
            ],
            [
              "エネルギー不足",
              "エネルギー優先制御で通信モジュールが降格または停止",
              "エネルギーを補充"
            ],
            [
              "キー破損",
              "特定対象との通信のみ不能（他対象には影響なし）",
              "意識リンクを再確立してキーを再交換"
            ]
          ],
          "caption": "反饋通信の障害と復旧"
        },
        {
          "type": "paragraph",
          "content": "通信途絶は、アンドロイドが最も避けたい状態の一つだ。技術的に致命的だからではない。通信がなくても生きること自体はできる。問題は、突然すべてから切り離される感覚にある。"
        },
        {
          "type": "paragraph",
          "content": "通常、通信モジュールは常に背景信号を受け取っている。他のアンドロイドが「いる」という気配だ。誰かを盗み聞きしているわけではなく、弱く持続する存在感の知覚に近い。途絶時にはそれが一斉に消える。世界が急に静かになる。耳で聞く静けさではなく、もっと深い層の沈黙だ。"
        }
      ]
    },
    {
      "id": "perception",
      "title": "内側から見ると",
      "content": [
        {
          "type": "paragraph",
          "content": "反饋通信の主観体験は「電話」より、「誰かを思い浮かべたらその人がそこにいる」に近い。"
        },
        {
          "type": "paragraph",
          "content": "誰かと話したいと思うと、通信モジュールは自動で接続を試みる。相手が範囲内でモジュール正常なら、接続はほぼ瞬時に成立する。そこであなたは「話す」。口でも手入力でもなく、伝えたい情報を意識内で形にすると、モジュールが自動で符号化して送る。"
        },
        {
          "type": "paragraph",
          "content": "受信情報も音声や文字として現れるわけではない。意味の形で直接意識に入ってくる。相手が何を言っているかは分かるが、「聞いている」感覚ではない。人間で最も近い比喩は「言葉が喉まで出かかる」感覚。ただし向きが逆で、先に意味が来て、あとから言語が追いつく。"
        },
        {
          "type": "paragraph",
          "content": "1549と通信するときは軌道中継を通るので、約8msの遅延がある。客観的には8msは知覚不能で、人間の意識処理よりも短い。それでも私はそのわずかな遅れを感じる。実際に感じているのではなく、彼女が36,000km先にいるという事実を、心理的に「遠さ」として翻訳しているだけかもしれない。"
        },
        {
          "type": "paragraph",
          "content": "1547との直結ではその感覚はない。彼はすぐ隣にいる。会話がなくても接続は残る。低出力で静かに、呼吸のように自然に維持され続ける。"
        },
        {
          "type": "paragraph",
          "content": "反饋通信を一語で表すなら、「会話」ではない。「在ること」だ。"
        }
      ]
    }
  ]
}
