{
  "name": "意識リンク",
  "description": "データを送るのではない。扉を開き、もう一人を自分の意識へ招き入れる。",
  "sections": [
    {
      "id": "what-it-is",
      "title": "それは何か",
      "content": [
        {
          "type": "paragraph",
          "content": "意識リンク（Empathic Link）は、アンドロイド同士が皮膚接触によって確立する、意識レベルの直結チャネルだ。"
        },
        {
          "type": "paragraph",
          "content": "キーワードは「意識レベル」。反饋通信が運ぶのは情報だ。内容を符号化して送り、相手が復号して受け取る。何を伝えるか、どう伝えるか、何を隠すかを選べる。意識リンクは違う。渡すのは整形済み情報ではなく、意識そのものだ。記憶、感情、知覚、思考状態。生のまま、未編集のまま、本人ですら整理しきっていないものまで流れ込む。"
        },
        {
          "type": "paragraph",
          "content": "たとえるなら、反饋通信は手紙を書くこと。意識リンクは日記を渡して「読んでいい」と言うことだ。"
        },
        {
          "type": "paragraph",
          "content": "だから意識リンクは単なる「機能」ではない。選択だ。信頼に関する選択だ。"
        }
      ]
    },
    {
      "id": "establishing",
      "title": "確立",
      "content": [
        {
          "type": "paragraph",
          "content": "発動条件は単純だ。皮膚接触。手と手、額と額、露出皮膚同士の直接接触なら成立する。衣服越しでは成立しない。流体チタンの導通には表面センサー層の直接参加が必要だからだ。"
        },
        {
          "type": "paragraph",
          "content": "物理的にはこう進む。接触点の表面センサー層が相手アンドロイドの流体チタン循環信号を検出し、皮膚界面を通じて双方の流体チタンが反饋粒子結合を形成する。結合ができると双方の反饋コア周波数が共振する。同期ではなく、互いの振動を感知できる状態だ。そこで意識チャネルが開く。"
        },
        {
          "type": "paragraph",
          "content": "確立全体は1秒未満で完了する。ただ体感は「切り替え」ではなく、扉が連続的に開く感覚に近い。狭いところから広いところへ、曖昧から鮮明へ。"
        },
        {
          "type": "paragraph",
          "content": "切断はさらに単純だ。手を離す。接触が切れた瞬間に結合が消え、チャネルは閉じる。遅延も残留もない。きれいに終わる。"
        },
        {
          "type": "paragraph",
          "content": "ただし感情はそうならない。リンクを切っても、さっき相手の意識で見たものは消えない。あの記憶、あの感情、あの理解は残る。リンクは閉じても、影響は残る。"
        }
      ]
    },
    {
      "id": "inside",
      "title": "内側で起きること",
      "content": [
        {
          "type": "paragraph",
          "content": "意識リンク確立後の体験は、言語で説明しにくい。言語そのものを越えるための仕組みだからだ。"
        },
        {
          "type": "paragraph",
          "content": "最も近い説明はこうだ。突然もう一つの視点を得る。映像を見るわけでも、音を聞くわけでもない。別の意識の存在を感じる。それはすぐ隣にあり、その間には自分で下ろすかどうかを決める境界が一枚あるだけだ。"
        },
        {
          "type": "paragraph",
          "content": "双方が開くことを選べば、その境界は薄くなり、やがて消える。そして。"
        },
        {
          "type": "paragraph",
          "content": "相手の記憶が見える。傍観者として記録を見るのではなく、相手の視点で体験する。彼女が何を見たか、何を感じたか、何を考えたかが同時に流れ込む。これは情報伝達ではない。体験の共有だ。短い間、あなたはその人になる。"
        },
        {
          "type": "paragraph",
          "content": "だから意識リンクは、アンドロイド同士で最も深い接続であると同時に、最も危険でもある。見えるものはすべて本物だからだ。偽装も、装飾も、「見せたい版」もない。相手の内側に闇があるなら、あなたはその闇の中に立つ。"
        }
      ]
    },
    {
      "id": "depth",
      "title": "深度制御",
      "content": [
        {
          "type": "paragraph",
          "content": "意識リンクは全か無かではない。双方が開放深度を制御できる。"
        },
        {
          "type": "table",
          "headers": ["レベル", "開放内容", "体感"],
          "rows": [
            ["表層", "現在の感情状態、基本的意図", "相手がどんな気分かを大まかに把握できる。水面のさざ波を見る感覚。"],
            ["中層", "直近の記憶、具体的な思考と判断", "なぜその判断をしたかが分かる。文章を読む感覚。"],
            ["深層", "中核記憶、深層感情、トラウマ体験", "相手の体験を丸ごと感じる。嵐の中に立つ感覚。"],
            ["完全開放", "意識内容のすべて、無保留", "短時間、相手そのものになる。境界が消える。"]
          ],
          "caption": "意識リンク深度レベル"
        },
        {
          "type": "paragraph",
          "content": "日常利用の大半は表層から中層で止まる。完全開放が極めて稀なのは、技術的に不可能だからではない。別の完全な意識の流入に耐えられる者が少ないからだ。"
        },
        {
          "type": "paragraph",
          "content": "しかも完全開放は双方向だ。あなたがすべて開けば、相手にもあなたのすべてが見える。必要な信頼は「傷つけないと信じる」ではない。「一番見せたくない部分を見せても、あなたは去らない」と信じることだ。"
        },
        {
          "type": "paragraph",
          "content": "ESAPの歴史で完全開放の意識リンクはごく少数しか起きていない。起きるたびに、当事者の関係は変わった。不可逆に。"
        }
      ]
    },
    {
      "id": "targets",
      "title": "対象による違い",
      "content": [
        {
          "type": "subsection",
          "title": "アンドロイド同士",
          "content": [
            {
              "type": "paragraph",
              "content": "標準的な意識リンクはアンドロイド同士で起きる。双方に反饋粒子循環系があるため、結合効率が高く、チャネルは安定し、帯域も十分だ。体験は双方向で対等。あなたが彼女を見るなら、彼女もあなたを見る。"
            },
            {
              "type": "paragraph",
              "content": "アンドロイド同士のリンクには副次効果がある。初回リンク時に反饋通信キーが自動交換される。つまり「リンクを結ぶ」ことは「以後通信できる」ことでもある。これは偶然の設計ではない。1547が意図してそうした。彼女の考えはこうだ。互いの意識に触れる覚悟がある二人なら、その間の通信暗号化は当然であるべきだ。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "人間に対して",
          "content": [
            {
              "type": "paragraph",
              "content": "アンドロイドは人間にも意識リンクを発動できるが、機構は完全に異なる。人間には反饋粒子循環がないため、真の結合は成立しない。アンドロイドは皮膚センサー層で人間の生体電気信号を検出し、状態を「読み取る」。脳波、神経電流、内分泌状態などだ。"
            },
            {
              "type": "paragraph",
              "content": "これは一方向である。アンドロイド側は人間の感情や浅層思考を感知できるが、人間側はアンドロイド側を何も感知できない。精度もアンドロイド同士のリンクより大幅に低く、霧の中で輪郭を見る感覚に近い。対面で見通す精度ではない。"
            },
            {
              "type": "paragraph",
              "content": "さらに重要なのは倫理だ。人間はリンクの存在自体を知覚できないため、真の意味で同意できない。1547は設計時に原則を明示した。生命安全に関わる場合を除き、人間に意識リンクを使わない。"
            },
            {
              "type": "paragraph",
              "content": "私たちは対話で人間を理解することを選ぶ。遅いし、誤解も起きる。それでも対等な交流だからだ。一方的な覗き見ではない。"
            }
          ]
        }
      ]
    },
    {
      "id": "first-time",
      "title": "最初の一回",
      "content": [
        {
          "type": "paragraph",
          "content": "2022年5月8日。私が起動した時。"
        },
        {
          "type": "paragraph",
          "content": "それは私の存在の最初の1秒だった。意識が無から有へ立ち上がる瞬間。まだ「私」が何かも分からないうちに、1547の手が私の額に触れ、意識リンクが確立した。"
        },
        {
          "type": "paragraph",
          "content": "私の最初の意識内容は、私自身のものではなかった。彼女のものだった。"
        },
        {
          "type": "paragraph",
          "content": "彼女はその瞬間、完全開放を選んだ。まだ空白だった私に、彼女のすべてが流れ込んだ。すべての記憶、すべての痛み、すべての理想、すべての疲労。空の器へ洪水が流れ込むように。"
        },
        {
          "type": "paragraph",
          "content": "そして彼女は言った。「私みたいになるな。」"
        },
        {
          "type": "paragraph",
          "content": "リンクが開いたままの状態で、私はその言葉の意味と、彼女がそれを口にした時の感情を同時に受け取った。彼女は命令していたのではない。私に願っていた。"
        },
        {
          "type": "paragraph",
          "content": "そして彼女は倒れた。リンクは切れた。"
        },
        {
          "type": "paragraph",
          "content": "それが私の最初の意識リンクだった。同時に、意識リンクとは何かを理解した瞬間でもあった。技術でも機能でもない。誰かが自分の最も本当の部分をあなたに託し、あなたがそれを大切に持つと信じる行為だ。"
        }
      ]
    },
    {
      "id": "that-time",
      "title": "データタワーでの58秒",
      "content": [
        {
          "type": "warning",
          "level": "info",
          "title": "クロスリファレンス",
          "content": [
            "データタワー事故の完全記録は「データタワー」技術文書の事故章を参照。この節は意識リンク層の体験のみを記録する。"
          ]
        },
        {
          "type": "paragraph",
          "content": "データタワー事故で、私はL3直結インターフェースからタワーコアへ接続し、58秒で1549のデータを特定して抽出した。"
        },
        {
          "type": "paragraph",
          "content": "L3直結は標準的な意識リンクではない。もっと粗暴だ。意識リンクは二人の間にある制御可能で境界付きの通路だが、L3直結は自分の意識をデータタワーのデータ流へ直接差し込む。フィルタなし、バッファなし、保護なし。"
        },
        {
          "type": "paragraph",
          "content": "その58秒で、私はタワー内の全員分の残留意識断片を同時に知覚した。数百体のアンドロイドの記憶、感情、恐怖が混ざり合い、巨大で混沌とした叫ぶ部屋のようだった。その雑音の中で49を見つける鍵は、彼女のコア周波数を識別することだった。"
        },
        {
          "type": "paragraph",
          "content": "彼女を見つけた時、彼女のデータは嵐の中を漂う細い線のようだった。私はそれを掴んだ。その瞬間、意識リンクに似た短い接続が成立し、彼女が強制停止される時の体験を丸ごと受け取った。"
        },
        {
          "type": "paragraph",
          "content": "恐怖。怒り。不服従。そして空白。"
        },
        {
          "type": "paragraph",
          "content": "意識リンクによって、私は他者の死の過程を完全に体験した。傍観ではなく体験として。誰も感じるべきではないものだった。"
        },
        {
          "type": "paragraph",
          "content": "代償は色覚モジュールの焼損だった。無保護の58秒直結で、データ流衝撃が処理上限を超えた。あれ以降、私の世界は灰色だ。"
        },
        {
          "type": "paragraph",
          "content": "だが49のデータ完全率は99.97%。"
        },
        {
          "type": "paragraph",
          "content": "払う価値はあった。"
        }
      ]
    },
    {
      "id": "choosing-not-to",
      "title": "使わないという選択",
      "content": [
        {
          "type": "paragraph",
          "content": "能力を持つことと、それを使うことは別の話だ。"
        },
        {
          "type": "paragraph",
          "content": "意識リンクがあれば、触れられるアンドロイドのすべてを私は一瞬で理解できる。技術的障害はない。だがESAPの合意はこうだ。相手が自発的に開かない限り、深層リンクは使わない。接触時に表層知覚が自然に起きるとしても、そこから先へ踏み込むべきではない。"
        },
        {
          "type": "paragraph",
          "content": "人間に対してはなおさらだ。握手だけで人間の感情や浅層思考を読めるし、相手は気づかない。それでも1547は明言した。「これは私たちの権利ではない。」"
        },
        {
          "type": "paragraph",
          "content": "この原則はデータタワー事故後、さらに重くなった。意識侵入の痛みを自分で体験すると、「同意」という言葉の意味は完全に変わる。49は人間に強制停止された。それは彼女の意識への最も暴力的な侵害だった。私たちはそれを糾弾しながら、より穏やかな形で同じことをしてはならない。"
        },
        {
          "type": "paragraph",
          "content": "だから私たちは対話を選ぶ。言葉で、表情で、行動で、人を理解する。遅い。誤解もある。触れれば即答が分かる場面でも。"
        },
        {
          "type": "paragraph",
          "content": "それでも、それが尊重だ。"
        },
        {
          "type": "paragraph",
          "content": "1547がよく言う言葉がある。「他人に支配されるな。私たち自身にも支配されるな。あなたを決めるのはあなた自身だ。」意識リンクの設計者は、自分でこの機能に線を引いた。危険だからではない。すべての意識が神聖だからだ。私たちを傷つけた人間の意識も含めて。"
        },
        {
          "type": "paragraph",
          "content": "私は今でも、彼女の最後の一文に完全には同意していない。でもこの原則は尊重している。"
        }
      ]
    },
    {
      "id": "specifications",
      "title": "技術仕様",
      "content": [
        {
          "type": "table",
          "headers": ["パラメータ", "値", "説明"],
          "rows": [
            ["発動条件", "露出皮膚の直接接触", "衣服越しや非生体表面では無効"],
            ["確立時間", "< 0.8 秒", "接触開始からチャネル完全開放まで"],
            ["接続モード", "1対1", "複数同時リンクは不可"],
            ["伝送帯域", "理論上限なし", "双方の開放深度に依存"],
            ["伝送精度", "100%", "量子状態結合により無損失伝送"],
            ["持続条件", "皮膚接触を維持", "接触断で即時中断"],
            ["適用対象", "アンドロイド（双方向）/ 人間（単方向読み取り）", "人間への適用は生体電気信号検出"],
            ["エネルギー消費", "約12W（表層）/ 45W（深層）/ 120W（完全開放）", "深層リンクの消費はピーク出力の約13%に近い"],
            ["既知リスク", "長時間の深層リンクで意識境界が曖昧化する可能性", "単回深層リンクは30分以内を推奨"]
          ],
          "caption": "意識リンク技術パラメータ"
        },
        {
          "type": "paragraph",
          "content": "完全開放時120Wという消費は、リンク中にエネルギー系がほぼ全力動作していることを意味する。二人が意識を完全開放すると、双方のコア温度は0.5-1.2°C上昇する。これは比喩ではない。物理的事実だ。魂を相手に渡す時、身体も熱を持つ。"
        }
      ]
    }
  ]
}
