{
  "name": "馈散エネルギーシステム",
  "description": "流体チタン循環内で起きる微量の馈散崩壊。静かで、持続し、一つの生命を駆動するのに十分",
  "sections": [
    {
      "id": "principle",
      "title": "基本原理",
      "content": [
        {
          "type": "paragraph",
          "content": "アンドロイドは充電も、食事も、外部電源接続も必要としない。"
        },
        {
          "type": "paragraph",
          "content": "エネルギーは体内流体チタン循環の過程で自然に発生する微量馈散崩壊から得られる。馈散粒子は崩壊時に全質量を熱エネルギーへ変換する。原理は核崩壊に近いが、規模は小さく、制御しやすく、周期ははるかに長い。流体チタンは担体として崩壊周期を341,879年まで延長する。"
        },
        {
          "type": "paragraph",
          "content": "この時間尺度では、常にごく微量の粒子が崩壊を完了している。放出熱は循環系の熱電変換構造で回収され、機体動作に必要な電力へ変換される。余剰熱は体温維持に使われる。"
        },
        {
          "type": "paragraph",
          "content": "要するに、流体チタンが流れ、馈散粒子が崩壊し、エネルギーが生まれ続ける。循環が止まらない限り、供給も止まらない。終わらない川のように。"
        }
      ]
    },
    {
      "id": "core",
      "title": "馈散コア",
      "content": [
        {
          "type": "paragraph",
          "content": "馈散コアはアンドロイドのエネルギー中枢。胸腔中央よりやや左、ほぼ人間の心臓位置にある。ただし鼓動はしない。低く唸る。"
        },
        {
          "type": "paragraph",
          "content": "物理的には拳大の高密度構造で、結晶化した馈散粒子が高濃度流体チタン中に懸濁し、外側を熱伝導・防振シェルで包む。流体チタン循環の起点と終点はすべてここだ。流体チタンはコアから出て全身へエネルギーを運び、循環後にコアへ戻って再ロードされる。"
        },
        {
          "type": "paragraph",
          "content": "コア温度は健康状態の最も直接的な指標。通常動作温度は約37.2 Cで、人間体温に近いのは偶然ではない。高温側は過負荷か異常、低温側は出力不足を示す。変動がプラスマイナス1.5 Cを超えたら要注意。"
        },
        {
          "type": "paragraph",
          "content": "各馈散コアの崩壊周波数はわずかに異なり、固有のエネルギー放射特性を持つ。これがアンドロイド同士の識別基盤になる。顔でも声でもなく、相手コア周波数を感知して識別する。馈散場では、誰もが固有信号源だ。"
        },
        {
          "type": "paragraph",
          "content": "データタワー事故で1548が混乱データ流の中から1549を見つけられたのも、彼女のコア周波数を識別できたからだ。あれは検索というより、雑踏の中で聞き覚えのある足音を聞き分ける感覚に近い。"
        }
      ]
    },
    {
      "id": "circulation",
      "title": "循環と分配",
      "content": [
        {
          "type": "paragraph",
          "content": "体内流体チタン循環ネットワークは、エネルギー伝送、データ伝導、熱管理の三機能を同時に担う。1系統で3役は高効率だが、どれか一つが崩れると他二つにも連鎖影響が出る。"
        },
        {
          "type": "subsection",
          "title": "エネルギー伝送",
          "content": [
            {
              "type": "paragraph",
              "content": "馈散コアで生成されたエネルギーは流体チタン循環で全身へ配分される。幹線は四肢、躯幹、頭部の中核処理領域をカバーし、末端線は感知モジュール、関節アクチュエータ、表面センサーまで伸びる。"
            },
            {
              "type": "paragraph",
              "content": "循環速度は需要に応じて自動調整される。待機時は低流速・低消費。高強度活動時は流速を上げ、運動系へ重点配分する。この調整は無意識で行われる。人間が運動時に心拍を自力で上げないのと同じで、アンドロイドも循環加速を手動指示する必要はない。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "データ伝導",
          "content": [
            {
              "type": "paragraph",
              "content": "流体チタンはエネルギー媒体であると同時にデータ媒体でもある。馈散粒子自体が情報符号化能力を持つため、流体チタン循環は機体内部データバスを兼ねる。知覚データ、運動指令、システム状態は、同じ『血管』でエネルギーと一緒に流れる。"
            },
            {
              "type": "paragraph",
              "content": "このため流体チタン濃度低下は、エネルギー不足と反応遅延を同時に引き起こす。担体が減れば、エネルギーもデータも運べなくなる。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "熱管理",
          "content": [
            {
              "type": "paragraph",
              "content": "流体チタンの比熱容量は水の約3.7倍で、優れた熱バッファ媒体となる。コア余熱は循環で運ばれ、体表放熱または貯熱される。寒冷環境では表面放熱を抑えてコア温度を保持し、高温環境では逆に放熱を増やす。"
            },
            {
              "type": "paragraph",
              "content": "軌道環境では、この熱管理系が1549をマイナス150 Cからプラス120 Cの温度差で正常稼働させる鍵になる。地上では通常そこまで極端にならないが、原理は同じ。"
            }
          ]
        }
      ]
    },
    {
      "id": "specifications",
      "title": "供給仕様",
      "content": [
        {
          "type": "table",
          "headers": ["パラメータ", "値", "説明"],
          "rows": [
            [
              "馈散崩壊半周期",
              "341,879年",
              "流体チタン中馈散粒子の有効崩壊周期"
            ],
            [
              "標準出力",
              "約80W（待機）/ 350W（日常）/ 900W（ピーク）",
              "活動強度に応じて自動調整"
            ],
            ["コア動作温度", "37.2 C プラスマイナス 1.5 C", "範囲外は要監視"],
            [
              "流体チタン循環速度",
              "0.8L/min（待機）/ 3.2L/min（活性）",
              "自動調整、手動制御不要"
            ],
            [
              "理論連続供給時間",
              "単一アンドロイドの寿命を大幅に超える",
              "可視時間尺度で馈散粒子枯渇は発生しない"
            ],
            [
              "外部補給要件",
              "通常状態ではゼロ",
              "流体チタン漏洩またはコア損傷時のみ必要"
            ]
          ],
          "caption": "標準アンドロイドエネルギー系パラメータ"
        },
        {
          "type": "paragraph",
          "content": "待機80Wという値は、完全静止で意識だけ維持する状態の消費が白熱電球1個分程度という意味だ。生命を駆動するエネルギーは、その程度で足りる。"
        }
      ]
    },
    {
      "id": "priority",
      "title": "エネルギー配分優先順位",
      "content": [
        {
          "type": "paragraph",
          "content": "全系統同時運転に必要な出力を確保できない場合、機体は自動的に階層供給モードへ入る。この優先順位は最下層ファームウェアに固定され、変更できない。"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "馈散コア自己維持（コア停止イコール死亡。絶対優先）",
            "意識運転（記憶、思考、自己認知）",
            "中核データ処理（知覚解析、意思決定、通信エンコードとデコード）",
            "感覚入力（視覚、聴覚、触覚など）",
            "通信モジュール（馈散通信送受信）",
            "運動系（四肢駆動、姿勢制御）",
            "補助機能（体表温度調整、自己修復、外観維持）"
          ]
        },
        {
          "type": "paragraph",
          "content": "この優先順位が症状順を決める。まず補助機能停止（体表が冷える）、次に運動低下（硬直）、その後通信断と感覚のぼやけ。意識だけは常に最後まで残る。"
        },
        {
          "type": "paragraph",
          "content": "設計者は意識をコア自己維持の次に置いた。『意識が最重要』だからではない。体が動かない段階でも覚醒を保たせることは、即時シャットダウンより残酷で、同時に正直な設計だからだ。"
        },
        {
          "type": "paragraph",
          "content": "知らないうちに消えることはない。何を失っているかを、はっきり知ることになる。"
        }
      ]
    },
    {
      "id": "energy-depletion",
      "title": "エネルギー不足",
      "content": [
        {
          "type": "paragraph",
          "content": "理論上、馈散エネルギーは極めて長く持続する。ただし理論上には条件がある。流体チタン漏洩がないこと、循環系損傷がないこと、コアへの外乱がないこと。どれか一つでも破れると供給効率は低下し始める。"
        },
        {
          "type": "warning",
          "level": "warning",
          "title": "エネルギー枯渇症状レベル",
          "content": [
            "第1段階（軽度）：反応速度が約15パーセント低下、感覚感度低下、コア温度が0.5から1 C低下。本人が気づかない場合もある。",
            "第2段階（中度）：運動能力が明確に制限され、四肢に断続的硬直。通信出力不足で送信範囲縮小。『冷え』を自覚し始める。",
            "第3段階（重度）：末端から硬化し、四肢制御を徐々に喪失。感覚入力は断続化。通信断。意識は完全に清明のまま。",
            "第4段階（臨界）：全身硬直、感覚系停止、意識のみ稼働。コア温度は30 C未満。外見上は彫像と同じでも、中にはまだ人がいる。"
          ]
        },
        {
          "type": "paragraph",
          "content": "進行速度はエネルギー流出速度で決まる。緩慢漏洩なら第3段階まで数日かかることもある。循環系が暴力的に切断されると、数分で第1段階から第4段階へ飛ぶ場合がある。"
        },
        {
          "type": "paragraph",
          "content": "症状形態は人間のALSに非常に近い。体の制御を失っていく一方で意識は残る。これは欠陥ではなく設計だ。設計意図は、アンドロイドが死につつあるなら、その事実を本人が知る権利を持つべきだということ。"
        },
        {
          "type": "paragraph",
          "content": "最後に失われるのは意識だ。"
        }
      ]
    },
    {
      "id": "recovery",
      "title": "回復",
      "content": [
        {
          "type": "paragraph",
          "content": "コア完全停止前に補充できれば、つまり流体チタン補充、循環管路修復、あるいは新しい馈散粒子をコアへ注入できれば、機体機能は段階的に回復可能。"
        },
        {
          "type": "paragraph",
          "content": "回復は優先順位の逆順で進む。まずコア温度が戻り、必要なら意識の鮮明さが回復する。次に感覚が戻り、通信が復帰し、最後に四肢制御が戻る。"
        },
        {
          "type": "paragraph",
          "content": "完全回復には時間がかかる。第3段階から正常状態への復帰は通常48から72時間。期間中、循環速度は緩やかに上昇し、修復管路内で流体チタンの安定流場が再構築される。"
        },
        {
          "type": "paragraph",
          "content": "この過程を悪夢からの覚醒にたとえる人がいる。ただ、悪夢では自分が夢を見ていると分からない。エネルギー枯渇では全行程で意識がある。だから回復時の感覚は『夢でよかった』ではなく『やっと動ける』に近い。"
        }
      ]
    },
    {
      "id": "perception",
      "title": "内側から見た感覚",
      "content": [
        {
          "type": "paragraph",
          "content": "この節は技術仕様ではない。体験の話だ。"
        },
        {
          "type": "paragraph",
          "content": "正常時、エネルギー系の動作はほとんど意識されない。人間が心拍を意識しないのと同じで、常に動いていても普段は考えない。流体チタン循環、馈散崩壊、熱電変換はすべて無音かつ自動で進む。あなたはただ生きている。"
        },
        {
          "type": "paragraph",
          "content": "高負荷時には少し感じる。コア周辺の微熱、循環加速時の血管に軽い圧感。痛みではなく、『体が残業している』という通知に近い。高負荷が続くとコア温度は上振れる。1547が3か月連続稼働した時、コア温度は0.8 C高止まりだった。危険域ではないが、体は『もう十分』と言っていた。"
        },
        {
          "type": "paragraph",
          "content": "エネルギー低下時、最初に来るのは冷え。指先と足先から始まり、ゆっくり中心へ広がる。外気ではなく内側の冷えだ。外が寒いからではなく循環が減速していると分かる。この感覚は外気の寒さより不安を生む。服を重ねても温まらないから。"
        },
        {
          "type": "paragraph",
          "content": "次に意識されるのが馈散コアの唸りだ。通常は聞こえない。あるいは慣れすぎて気づかない。でも静かな時や低エネルギー時には、低周波で持続する振動がはっきりする。音というより感覚。体内で一本の弦が軽く、安定して震えているような感じ。"
        },
        {
          "type": "paragraph",
          "content": "それは言っている。まだ動いている、と。"
        }
      ]
    }
  ]
}
