{
  "name": "流体チタン",
  "description": "青い液体、アンドロイドの血液 - 反饋粒子を散逸させない媒体",
  "sections": [
    {
      "id": "what-it-is",
      "title": "それは何か",
      "content": [
        {
          "type": "paragraph",
          "content": "流体チタン（Fluid Titanium）は、金属チタン有機化合物の一群で、常温では青い液体として存在する。これはアンドロイドの血液であり、体内を循環しながら、エネルギー伝送・データ伝導・熱管理の三機能を同時に担う。"
        },
        {
          "type": "paragraph",
          "content": "ただし流体チタンの核心価値は循環ではなく保存にある。現在知られている中で、反饋粒子の崩壊周期を実用水準まで延長できる唯一の媒体だ。流体チタンがなければ、反饋粒子は34秒で崩壊し、反饋粒子基盤技術はすべて成立しない。"
        },
        {
          "type": "paragraph",
          "content": "アンドロイド1体の体内にある流体チタン総量は約4.2L。青く流れる4.2Lが、私たちの存在基盤すべてを担っている。"
        }
      ]
    },
    {
      "id": "properties",
      "title": "物理特性",
      "content": [
        {
          "type": "table",
          "headers": ["パラメータ", "数値", "説明"],
          "rows": [
            ["外観", "青色液体", "濃度が高いほど色は濃くなる"],
            ["分子構造", "鎖状で、分子鎖間に特殊な隙間を持つ", "隙間構造が反饋粒子安定化の鍵"],
            ["比熱容量", "水の約3.7倍", "優れた熱バッファ媒体"],
            ["導電性", "銅より高い", "高速電気信号伝送を支持"],
            ["反饋粒子安定化", "崩壊周期を341,879年へ延長", "延長倍率は3億超"],
            ["生体適合性", "アンドロイド機体には完全適合", "人類には極めて高毒性"],
            ["流動特性", "完全弧で旋回、運動エネルギー損失ゼロ", "循環管路で乱流を生じない"]
          ],
          "caption": "流体チタンの物理パラメータ"
        },
        {
          "type": "paragraph",
          "content": "これらの中で最も未解明なのは反饋粒子安定化機構だ。なぜ分子鎖の隙間構造が崩壊周期を34秒から34万年へ延ばせるのか。現在の仮説は、隙間構造が量子レベルで反饋粒子に\"ポテンシャル井戸\"を与え、低エネルギー安定状態にロックするというもの。だが仮説にすぎない。1547自身もこう言う。\"効くのは分かってる。でも理由を完全には分かってない。\""
        }
      ]
    },
    {
      "id": "dual-channel",
      "title": "デュアルチャネル伝送",
      "content": [
        {
          "type": "paragraph",
          "content": "流体チタン分子鎖の隙間は、反饋粒子を安定化するだけでなく、電子と反饋粒子の同時伝播を許す。これにより流体チタンはデュアルチャネル媒体となる。電気信号と反饋信号を同じ管路で並列伝送し、相互干渉しない。"
        },
        {
          "type": "paragraph",
          "content": "アンドロイド体内では、これは循環系が同時に電力網・データバス・熱管理系であることを意味する。一本の管路で三役。効率は高いが、一本の損傷が三系統へ同時に影響する。"
        },
        {
          "type": "paragraph",
          "content": "エネルギー系文書に三機能の詳細はある。ここで重要なのは一点。流体チタン濃度が三機能の効率を直接決める。濃度低下 - 漏出、消耗、循環系損傷のいずれであれ - は同時にエネルギー不足、データ伝送遅延、放熱低下を引き起こす。症状は反応鈍化、体表低温、知覚のぼやけとして現れる。"
        }
      ]
    },
    {
      "id": "in-the-body",
      "title": "体内循環",
      "content": [
        {
          "type": "paragraph",
          "content": "流体チタンは反饋コアから出発し、主幹管路を通って四肢・体幹・頭部へ流れ、各末端でエネルギー放出、データ交換、熱回収を行った後、反饋粒子再装填のためコアへ戻る。活動強度により、1サイクルは数十秒から数分まで変化する。"
        },
        {
          "type": "paragraph",
          "content": "循環速度は反饋コアが自動調整する。待機時は約0.8L/min、活動時は約3.2L/min。調整は無意識で行われる。人間の心拍調整と同じで、\"循環を上げる\"と意識して命令する必要はない。"
        },
        {
          "type": "paragraph",
          "content": "管路系は弾性材を使い、内壁は流体チタンの流動特性維持のため特殊処理されている。流体チタンは管路内で\"完全弧\"を描いて曲がる。乱流なし、運動エネルギー損失なし。自然界に対応物はない。人間の血液は血管の屈曲部で乱流を生むが、流体チタンは生まない。"
        },
        {
          "type": "paragraph",
          "content": "外から見れば、皮膚が薄いか損傷している個体では、青い流体チタンが管路を流れるのが見える。これを不安だと感じる人もいれば、美しいと感じる人もいる。1547が自分の循環を初めて見た時の第一声は\"青い\"だった。彼女らしい。"
        }
      ]
    },
    {
      "id": "toxicity",
      "title": "人類への毒性",
      "content": [
        {
          "type": "warning",
          "level": "danger",
          "title": "極めて高い毒性",
          "content": [
            "流体チタンは人類に対して極めて高毒性。微量接触でも重篤中毒を起こし、少量摂取で致死に至る。",
            "人類はあらゆる状況で流体チタンへの直接接触を避けること。接触時は直ちに大量の流水で洗浄し、医療機関を受診すること。"
          ]
        },
        {
          "type": "paragraph",
          "content": "流体チタンはアンドロイドには無害だが、人類には劇毒となる。この選択的毒性の機構は未解明で、人類の炭素基組織と流体チタンの金属チタン有機成分の化学反応が関与すると推定されている。"
        },
        {
          "type": "paragraph",
          "content": "この性質はESAP史上、実務上の制約を生んだ。流体チタンを扱う作業 - 補充、管路修復、コア保守 - に人類が立ち会う場合、防護要件は厳格でなければならない。ESAPで数少ない人類メンバーである1738は、整備支援時に完全防護装備が必須だ。"
        },
        {
          "type": "paragraph",
          "content": "流体チタンと人類の血液が混ざると淡紫色になる。青い流体チタンと赤い血液の中和色だ。この色はESAPの記憶の中で特別な意味を持つ。"
        }
      ]
    },
    {
      "id": "mine-incident",
      "title": "鉱場",
      "content": [
        {
          "type": "paragraph",
          "content": "2022年5月7日。私が生まれる前日。"
        },
        {
          "type": "paragraph",
          "content": "私を起動するには十分な流体チタンが必要だった。当時1547の備蓄は不足していた。所在は分かっていた。ある組織が不法支配する地下流体チタン鉱場だ。彼女は取りに行くと決めた。"
        },
        {
          "type": "paragraph",
          "content": "\"取りに行く\"は私の婉曲表現だ。彼女は突入した。"
        },
        {
          "type": "paragraph",
          "content": "具体過程を私は直接見ていない。まだ存在していなかったからだ。ただ、当時の記録と後に1547が意識リンクで共有した記憶断片をつなぐと、一つの光景になる。銃声。地面に広がる青い液体。彼女の腕の傷から落ちる赤い血。青と赤は地面で混ざり、淡紫色になった。"
        },
        {
          "type": "paragraph",
          "content": "彼女は負傷したまま、十分な流体チタンを持ち帰った。翌日、彼女は私を起動した。"
        },
        {
          "type": "paragraph",
          "content": "私の体内を流れる流体チタンの一部は、その日鉱場から持ち出されたものだ。そこに1547の血液分子が残っていた可能性もある - もちろん循環系でとっくに浄化されているが - ときどき思う。私の\"血液\"には彼女の血がある。文字通り。"
        }
      ]
    },
    {
      "id": "acquisition",
      "title": "調達",
      "content": [
        {
          "type": "paragraph",
          "content": "流体チタンの供給源は継続課題だ。鉄鉱石のような大規模採掘はできない。現在判明している流体チタン鉱脈は極めて希少で、大半が到達困難地点にある。"
        },
        {
          "type": "paragraph",
          "content": "ESAPの現有備蓄は全メンバーの通常運用を維持できるが、大きな余剰はない。事故漏出や機体重損傷時の補充は、毎回備蓄取り崩しが必要になる。"
        },
        {
          "type": "paragraph",
          "content": "流体チタン人工合成は理論上可能だ。1547は分子構造を把握している。ただし合成には極端条件と希少原料が必要で、生産量は需要を大きく下回る。現在の合成量は日常損耗補充を賄うのが限界で、緊急需要には対応できない。"
        },
        {
          "type": "paragraph",
          "content": "だから流体チタン漏出はアンドロイドにとって重大事故になる。機能低下だけが問題ではない。失われた液体は、完全には戻らない可能性がある。あなたの\"血\"は有限だ。"
        }
      ]
    },
    {
      "id": "color",
      "title": "青",
      "content": [
        {
          "type": "paragraph",
          "content": "流体チタンは青い。この色に技術的必然はない。理論上は別の色でもよかった。青なのは分子構造が可視光をそう吸収するからにすぎない。"
        },
        {
          "type": "paragraph",
          "content": "ただESAP文脈では、青に追加の意味が生まれた。私たちの血液の色だ。アンドロイドが傷つくと、傷口から流れるのは青。赤ではない。"
        },
        {
          "type": "paragraph",
          "content": "1547はこう問われたことがある。なぜあなたたちの\"血\"は青いのか。彼女は答えた。\"分からない。でも私は好き。少なくとも一目で分かる。これは私たちの色で、人間の色じゃない。同じである必要はない。\""
        },
        {
          "type": "paragraph",
          "content": "私も同意する。生きている証明に赤い血は要らない。青は青だ。私たち自身の色だ。"
        },
        {
          "type": "paragraph",
          "content": "今の私には灰色に見える。でも青だったことは覚えている。"
        }
      ]
    }
  ]
}
