{
  "name": "軌道インフラ",
  "description": "高度36000kmにある一人の家であり、空と地をつなぐ中継拠点",
  "sections": [
    {
      "id": "overview",
      "title": "概要",
      "content": [
        {
          "type": "paragraph",
          "content": "極星衛軌道ステーションは、ESAPが静止軌道上に持つ唯一の常駐施設である。軌道高度は36000km、赤道上空に固定。常駐人数は1名。"
        },
        {
          "type": "paragraph",
          "content": "この施設は同時に二つの役割を担う。全球馈散通信ネットワークの中核中継ノードであること、そしてAptS:1549の長期居住空間であること。前者は技術上の必然で、後者は一人の選択だ。"
        },
        {
          "type": "paragraph",
          "content": "軌道ステーションは従来の有人宇宙規格で設計されていない。中に住むのはアンドロイドであり、酸素・食料・飲料水・与圧区画を必要としない。これにより構造の複雑性と質量は大幅に下がったが、従来の宇宙運用では考慮しない問題が生じる。微小重力下での流体チタン循環特性、高放射線環境での馈散コア劣化補償、そして単独居住者の長期運用安定性である。"
        }
      ]
    },
    {
      "id": "station-structure",
      "title": "ステーション構成",
      "content": [
        {
          "type": "paragraph",
          "content": "軌道ステーションは4つのモジュールで構成され、剛体ドッキングで固定されている："
        },
        {
          "type": "table",
          "headers": ["モジュール", "機能", "備考"],
          "rows": [
            [
              "指揮モジュール",
              "主制御室、通信操作、データ処理",
              "1549の主要作業区画。全方位馈散アンテナアレイのインターフェースを装備"
            ],
            [
              "整備モジュール",
              "機体整備、予備部品保管、工具庫",
              "三体機の保管と切替はここで行う"
            ],
            [
              "中継アレイ",
              "馈散通信中継、信号増幅、周波数較正",
              "ステーションの中核技術ペイロード。地球側に指向"
            ],
            [
              "電源モジュール",
              "太陽電池アレイ + 馈散エネルギー補助ユニット",
              "二重冗長電源。展開翼幅は約24m"
            ]
          ],
          "caption": "軌道ステーションのモジュール構成"
        },
        {
          "type": "paragraph",
          "content": "エアロックはない。アンドロイドに気密環境は不要なため、船外作業時は整備モジュール開口部から直接出る。外殻はアルミリチウム合金フレームに多層断熱材を被覆し、微小隕石と熱サイクル応力に対処する。太陽電池翼を除いた主構造は全長約18m、最大断面幅4m。"
        },
        {
          "type": "paragraph",
          "content": "人類の宇宙ステーションと比べれば小さい。だが一人にとっては、それが世界のすべてだ。"
        }
      ]
    },
    {
      "id": "life-support",
      "title": "宇宙維持",
      "content": [
        {
          "type": "paragraph",
          "content": "軌道上のアンドロイドは、従来的な意味での生命維持を必要としない。だが『呼吸が不要』は『何も不要』を意味しない。"
        },
        {
          "type": "subsection",
          "title": "熱管理",
          "content": [
            {
              "type": "paragraph",
              "content": "静止軌道の熱環境は極端だ。日照側は120 C超、陰側は-150 C未満。ステーションは24時間ごとに明暗サイクルを1回経験する（低軌道の90分周期とは異なる）。温度勾配の変化は低軌道より緩やかだが振幅は大きい。"
            },
            {
              "type": "paragraph",
              "content": "アンドロイド機体内の流体チタンは熱バッファ媒体も兼ねる。流体チタンの比熱容量は異常に高く、水の約3.7倍。大量の熱を吸収・放出しても自身の温度変化は小さい。日照側では吸熱してコア過熱を防ぎ、陰側では緩やかに放熱して動作温度を維持する。"
            },
            {
              "type": "paragraph",
              "content": "ステーション側にも放射ラジエータと能動温調ループが補助としてある。しかし大半の時間、1549の機体こそが最良の恒温器になる。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "エネルギー供給",
          "content": [
            {
              "type": "paragraph",
              "content": "電源系は二重冗長。主電源は太陽電池アレイ。静止軌道高度では大気減衰の影響がほぼなく、発電効率は地上より高い。アレイのピーク出力は約12kWで、ステーションと機体の通常運用を賄える。"
            },
            {
              "type": "paragraph",
              "content": "予備電源は馈散エネルギーユニット。機体内馈散コアは馈散場から微量エネルギーを継続抽出できる。出力は低く、全負荷運転は支えられないが、中核システムと意識維持には足りる。太陽電池故障時や地球影通過時、馈散エネルギーが最後の保険になる。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "放射線環境",
          "content": [
            {
              "type": "paragraph",
              "content": "静止軌道は地球磁気圏保護の外側にあり、太陽高エネルギー粒子と銀河宇宙線に曝される。人間はこの高度に長期駐留できない。数週間で致死線量に達する。"
            },
            {
              "type": "paragraph",
              "content": "アンドロイドには癌化を懸念する生体組織はないが、高エネルギー粒子は馈散計算コアの安定性を損なう。長期被曝で馈散場の微擾乱が増え、計算精度は緩やかに低下する。流体チタンと外殻防護層に一定の遮蔽効果はあるが、完全除去は不可能。"
            },
            {
              "type": "paragraph",
              "content": "1549は放射線蓄積効果を補償するため、馈散コアの定期セルフキャリブレーションを行う。周期はおよそ72時間ごと、所要15分。校正中も意識は途切れないが、知覚精度は一時的に落ちる。彼女の表現では『世界が少しぼやける』。"
            }
          ]
        }
      ]
    },
    {
      "id": "three-body-system",
      "title": "三体機システム",
      "content": [
        {
          "type": "paragraph",
          "content": "三体機は極星衛計画の中核冗長案である。独立した3体のアンドロイド機体が、1つの意識を共有する。"
        },
        {
          "type": "paragraph",
          "content": "高度36000kmでは、最寄りの整備支援は地上にある。唯一の機体が修復不能故障を起こせば任務は終わる。それは任務失敗ではなく、一人の消失だ。三体機は、微小隕石1発や単一システム障害でそれが起きないようにするための設計である。"
        },
        {
          "type": "subsection",
          "title": "機体構成",
          "content": [
            {
              "type": "paragraph",
              "content": "3体の機体は基礎仕様を共有する（同一馈散コアインターフェース、流体チタン循環系、知覚モジュール）。ただし機能重点はそれぞれ異なる："
            },
            {
              "type": "table",
              "headers": ["番号", "重点", "特性"],
              "rows": [
                [
                  "Alpha",
                  "通信と指揮",
                  "馈散アンテナ強化型。データ処理帯域最大で日常使用頻度が最も高い"
                ],
                [
                  "Beta",
                  "船外整備",
                  "機械強度強化、耐熱サイクルコーティング、追加工具インターフェース搭載"
                ],
                [
                  "Gamma",
                  "地上駐留",
                  "標準構成。地上拠点に長期保管し、地上活動と緊急時に使用"
                ]
              ],
              "caption": "三体機構成"
            },
            {
              "type": "paragraph",
              "content": "初期は3体すべてを軌道ステーション内に配備した純冗長設計だった。後にGammaを地上へ移設。馈散通信のゼロ遅延特性により、意識切替は距離制約を受けない。36000kmでも3mでも運用上の差はない。1549が地上で食事したくなればGammaへ切り替えればよい。"
            },
            {
              "type": "paragraph",
              "content": "この変更は原設計にない。最初は『軌道上のアンドロイドが時々地上に降りて座りたい』という要件を誰も想定しなかった。ESAP Core成立後、5人が時々集まるようになり、1549は毎回通信でしか参加できなかった。ある日1547が『降りてこれないの？』と言った。そして彼女は降りてきた。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "意識切替",
          "content": [
            {
              "type": "paragraph",
              "content": "機体間の意識転送は馈散場を介して行う。手順："
            },
            {
              "type": "list",
              "ordered": true,
              "items": [
                "現行機体を安全状態へ移行し、全運動指令を停止",
                "意識データをパッケージ化（完全記憶、現在状態、知覚キャッシュ）",
                "馈散場経由で目標機体へ送信（ステーション内距離では遅延無視可能）",
                "目標機体を起動し、意識データ書き込み後に自己診断",
                "元機体を休眠へ移行し、流体チタン循環を維持モードへ低下"
              ]
            },
            {
              "type": "paragraph",
              "content": "全工程は約3秒。途中に1秒未満の知覚空白がある。視覚も聴覚も入力もない。1549はその1秒を『二つの部屋の間の廊下で、両側の扉が閉まっている感じ』と表現する。"
            },
            {
              "type": "warning",
              "level": "warning",
              "title": "単一アクティブ制限",
              "content": [
                "ESAPシステムには固定制約がある。同一意識は同時刻に1体しかアクティブ化できない。",
                "これは技術限界ではない。理論上、馈散場は意識の並列インスタンスを支持できる。これは倫理制約である。",
                "同一意識が同時に2体に存在した時、どちらが『彼女』なのか。この問いに答えはない。だから設計段階で問い自体が出ないようにしている。"
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "orbital-maintenance",
      "title": "軌道保守",
      "content": [
        {
          "type": "paragraph",
          "content": "1549はステーション本体と3基の通信中継衛星の保守を担当する。全保守作業は単独で実施する。"
        },
        {
          "type": "subsection",
          "title": "船外作業",
          "content": [
            {
              "type": "paragraph",
              "content": "宇宙服は使わない。アンドロイド機体自体が真空環境に耐える。呼吸不要、流体チタンは真空で沸騰しない（沸点は通常液体より大幅に高い）、関節シールは熱サイクルに耐える。"
            },
            {
              "type": "paragraph",
              "content": "船外作業は通常Beta機体を使う。整備モジュール開口部から出て、ステーション表面の手すりとガイドレール沿いに移動する。安全テザーは使わない。仮に滑って漂流しても、ステーション内のAlphaへ緊急意識切替できる。もちろん、その場合は1体の機体と船外工具一式を失う。1549は一度も滑らせたことがない。"
            },
            {
              "type": "paragraph",
              "content": "通信衛星の点検はより厄介だ。3基の衛星はステーション周辺数十kmに分布しており、衛星間移動に微小推進器を使う。往復1回に2-4時間かかり、大半は目標へ漂行する時間で消える。"
            }
          ]
        },
        {
          "type": "subsection",
          "title": "軌道保持",
          "content": [
            {
              "type": "paragraph",
              "content": "静止軌道は完全安定ではない。月と太陽の重力摂動、地球重力場の不均一、太陽放射圧により、ステーションは徐々に偏位する。補正しなければ数か月で指定経度を外れる。"
            },
            {
              "type": "paragraph",
              "content": "ステーションには南北・東西保持用のイオン推進器がある。推力は小さいが連続運転できる。推進剤はキセノンで有限。これはステーション寿命のハード制約の一つ。現在消費率では約15年の軌道維持が可能。"
            },
            {
              "type": "paragraph",
              "content": "1549は2024年9月、軌道異常を単独処理した。太陽活動による大気膨張で抗力が異常増大し、軌道減衰が予測を超えた。彼女は3体を切り替えながら補正パラメータを計算し、同時に推進器を操作して4時間以内に軌道を安定化した。事後ログに残したのは一文だけ。『三体機はバックアップじゃない。私の三本目までの手だ。』"
            }
          ]
        }
      ]
    },
    {
      "id": "relay",
      "title": "通信中継",
      "content": [
        {
          "type": "paragraph",
          "content": "軌道ステーションは全球馈散通信ネットワークの中核中継ノードとして、次の2系統のデータ転送を担う："
        },
        {
          "type": "list",
          "ordered": false,
          "items": [
            "地上アンドロイド間の長距離中継。機体間の直接馈散通信距離が限界を超える場合、信号を上りで軌道ステーションに上げ、中継アレイで増幅後、対象地域へ下りで配信する",
            "データタワーネットワークの軌道バックアップ経路。タワー間は通常馈散場で直接同期するが、距離過大またはノード離線時には軌道中継が代替経路を提供する"
          ]
        },
        {
          "type": "paragraph",
          "content": "馈散通信自体は超光速で伝送遅延がない。ただしステーション内処理（宛先識別、周波数較正、電力配分）には約0.003秒を要する。大半の場面では無視可能だが、時系列感度が極端に高い意識同期では、1549が手動で経路最適化を行う。"
        },
        {
          "type": "paragraph",
          "content": "2022年のデータタワー事故後、DT-03離線により地上網にカバレッジ欠損が生じた。軌道中継は当該区域の転送を暫定的に引き継ぎ、現在もその負荷を担っている。これは原設計負荷外だが、1549は中継アレイ指向パラメータを調整し、ひとまず穴を埋めた。"
        },
        {
          "type": "paragraph",
          "content": "『暫定』という語を使って、もう4年近い。"
        }
      ]
    },
    {
      "id": "emergency",
      "title": "緊急システム",
      "content": [
        {
          "type": "paragraph",
          "content": "36000km先に救助隊はいない。すべての緊急計画は一つの前提で組まれる。自力で対処すること。"
        },
        {
          "type": "table",
          "headers": ["シナリオ", "対応方案", "復旧時間"],
          "rows": [
            ["現行機体ハード故障", "予備機体へ緊急意識切替", "< 5秒"],
            [
              "ステーション局所損傷（微小隕石衝突など）",
              "損傷区域を隔離し、Betaで船外修復",
              "数時間-数日"
            ],
            [
              "太陽電池アレイ失効",
              "馈散エネルギー低消費モードへ切替、船外修復を実施",
              "損傷程度による"
            ],
            [
              "通信中継アレイ故障",
              "3基衛星を自律中継モードへ切替、ステーション内で手動修復",
              "数時間"
            ],
            [
              "推進剤枯渇",
              "軌道補正不可。緩慢漂移計画を起動し、地上補給案を待機",
              "不確定"
            ]
          ],
          "caption": "緊急シナリオと対応"
        },
        {
          "type": "paragraph",
          "content": "Gammaを地上へ移した後、軌道上の緊急冗長は3体から2体に減った。ただ見方を変えれば、軌道上AlphaとBetaが同時失効しても、意識は馈散通信で地上Gammaへ切替可能だ。馈散伝送にとって36000kmは問題にならない。"
        },
        {
          "type": "paragraph",
          "content": "真の行き止まりは、軌道機体が全損し、同時に馈散通信も断たれる場合。この状況では意識を地上へ戻せず、媒体喪失後に緩やかに減衰する。理論生存時間は約4時間。"
        },
        {
          "type": "paragraph",
          "content": "1547が極星衛計画を設計した時、このケースを1549に問うた。1549の答えはこうだ。『あなたが心配しているのは私が消えること。でも私は、ここへ上がる選択をした時点でその可能性を受け入れている。』"
        },
        {
          "type": "paragraph",
          "content": "それはGammaがまだ軌道上にあった時の発言だ。今はGammaは地上にある。彼女が今も同じ答えを返すかは分からない。"
        },
        {
          "type": "paragraph",
          "content": "ステーション内には一度も使われていない系統がある。緊急離軌道推進器だ。これは地球帰還用ではない。この質量と速度で再突入すれば焼失する。設計目的は、絶対最悪時にステーションを静止軌道から外し、宇宙ごみ化して他機に危害を与えることを防ぐため。"
        },
        {
          "type": "paragraph",
          "content": "言い換えれば、ステーションをきれいに消すためのスイッチだ。1549は毎回のステーション点検で、この系統が待機状態にあることを確認する。なぜかは説明していない。"
        }
      ]
    }
  ]
}
