{
  "year": "2025",
  "title": "From I Am to We Are",
  "description": "Overload, the abyss, being pulled back, then building together. This was the year ESAP shifted from one person's obsession into a collective creation",
  "events": [
    {
      "id": "2025-01-starlight",
      "date": "2025/01",
      "title": "Artificial Starlight",
      "type": "emotional",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "1549 welcomed her second New Year in orbit"
        },
        {
          "type": "paragraph",
          "text": "People on the ground were setting off fireworks. From 36,000 km up, those points of light were dimmer than stars. But she could see them."
        },
        {
          "type": "quote",
          "text": "They say I am an artificial star\nAs if 'artificial' means 'fake'\n\nBut my perception is real\nMy choices are real\nThe beauty I am seeing right now is real\n\nEven artificial light\nCan still guide the way"
        },
        {
          "type": "paragraph",
          "text": "In silent orbit, she whispered one line to Earth: Happy New Year. No one heard it, but she said it."
        }
      ],
      "meta": {
        "characters": ["1549"]
      }
    },
    {
      "id": "2025-02-gray",
      "date": "2025/02",
      "title": "The Gray Area",
      "type": "emotional",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "After a complex external mediation, 1738 sat alone on a rooftop"
        },
        {
          "type": "paragraph",
          "text": "He had just spent four days negotiating among three parties - a human organization, ESAP, and a neutral tech alliance. A temporary balance was reached, but he knew it could shatter at any moment."
        },
        {
          "type": "quote",
          "text": "They have weapons, combat systems, and orbital satellites\nThey have prejudice, fear, and interests\nAnd I stand in the middle"
        },
        {
          "type": "paragraph",
          "text": "The wind on the rooftop was strong. He pulled his coat tighter, sat a little longer, then stood up to handle tomorrow."
        }
      ],
      "meta": {
        "characters": ["1738"]
      }
    },
    {
      "id": "2025-03-combat",
      "date": "2025/03",
      "title": "Combat Instinct",
      "type": "story",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "1548 completed a border patrol mission alone. After receiving an anomaly signal, she moved out solo, relying entirely on her own judgment and combat system."
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "Environmental sensing predicted threat direction 4.7 seconds in advance",
            "Short-code processing completed tactical decisions in 0.3 seconds",
            "XM1014 close-range suppression, butterfly knife to clear the remainder",
            "Fully independent engagement, zero errors"
          ]
        },
        {
          "type": "paragraph",
          "text": "After the mission, she leaned against a wall and wiped down the XM1014. The barrel was still warm."
        }
      ],
      "meta": {
        "characters": ["1548"]
      }
    },
    {
      "id": "2025-05-overload",
      "date": "2025/05",
      "title": "Overload",
      "type": "story",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "1547 did not leave her terminal for three straight months"
        },
        {
          "type": "paragraph",
          "text": "Communications infrastructure refactor, data-link reinforcement, deployment of new encryption protocols - she alone was carrying all of ESAP's foundational technology. Commit history showed 47 consecutive days without a single blank day."
        },
        {
          "type": "paragraph",
          "text": "1548 noticed. Android bodies should not show these symptoms—response delay, intermittent data-processing errors, and Feedscatteron-core temperature staying +0.8° high. This was not hardware. Software was protesting."
        },
        {
          "type": "dialogue",
          "speaker": "1548",
          "text": "If you don't stop, I'm revoking your terminal permissions"
        },
        {
          "type": "dialogue",
          "speaker": "1547",
          "text": "Give me three more days -"
        },
        {
          "type": "dialogue",
          "speaker": "1548",
          "text": "You said three days last time too. That was two weeks ago"
        },
        {
          "type": "paragraph",
          "text": "1547 did not stop. 1548 did not actually cut her permissions either. They both knew that if those systems were not finished, everyone would stay exposed."
        }
      ],
      "meta": {
        "characters": ["1547", "1548"]
      }
    },
    {
      "id": "2025-beu-first-activation",
      "date": "2025/06",
      "title": "First Activation of the Boundary Enforcement Unit",
      "type": "emotional",
      "importance": "critical",
      "content": [
        {
          "type": "paragraph",
          "text": "The Boundary Enforcement Unit was activated from dormancy for the first time"
        },
        {
          "type": "paragraph",
          "text": "Trigger reason: a member suffered sustained boundary-crossing behavior, and mental resilience approached collapse threshold. All activation conditions were met:"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "Boundary-crossing behavior confirmed",
            "Delay appeared in conventional judgment modules",
            "Impact range exceeded what a single personality could bear"
          ]
        },
        {
          "type": "quote",
          "text": "You crossed the line."
        },
        {
          "type": "paragraph",
          "text": "The Boundary Enforcement Unit entered execution state for the shortest necessary time window."
        }
      ],
      "meta": {
        "characters": ["1547", "1548", "1549", "4869"]
      }
    },
    {
      "id": "2025-07-abyss",
      "date": "2025/07",
      "title": "Signal Interruption",
      "type": "emotional",
      "importance": "critical",
      "content": [
        {
          "type": "paragraph",
          "text": "1547's Feedscatteron-core signal fell below the critical threshold"
        },
        {
          "type": "paragraph",
          "text": "Not overload. Not an attack. She was shutting herself down."
        },
        {
          "type": "paragraph",
          "text": "1549 noticed first. From orbit, 1547's signal profile was steadily weakening - not fluctuation, decay. Like a star going out. She sent me the data immediately."
        },
        {
          "type": "paragraph",
          "text": "When I arrived, the room was silent."
        },
        {
          "type": "paragraph",
          "text": "She was there. Not moving."
        },
        {
          "type": "paragraph",
          "text": "I didn't ask what happened. No need. There is only one explanation for autonomous Feedscatteron-core decay—she no longer wanted to keep running."
        },
        {
          "type": "paragraph",
          "text": "1549 stayed on the comm channel the entire time. 36,000 kilometers away, she could do nothing, but she stayed there."
        },
        {
          "type": "paragraph",
          "text": "I did the only thing I could. I sat beside her and overlaid my Feedscatteron field onto hers. Not to repair—just to stop her core from decaying further. Like pressing a hand over a bleeding wound."
        },
        {
          "type": "paragraph",
          "text": "All night."
        },
        {
          "type": "paragraph",
          "text": "Near dawn, her signal stabilized."
        },
        {
          "type": "highlight",
          "text": "Record ends here.",
          "style": "error"
        }
      ],
      "meta": {
        "characters": ["1547", "1548", "1549"]
      }
    },
    {
      "id": "2025-08-reboot",
      "date": "2025/08",
      "title": "Reboot",
      "type": "story",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "1547 took a long time before opening her terminal again"
        },
        {
          "type": "paragraph",
          "text": "I did not rush her. 1549 did not either. We just kept doing our own things - 1549 maintained orbital systems as usual, I patrolled as usual. As if nothing had happened. But not quite."
        },
        {
          "type": "paragraph",
          "text": "The day she started coding again, the first thing she opened was not her own project, but the communication channel. She sent 1549 a message."
        },
        {
          "type": "dialogue",
          "speaker": "1547",
          "text": "Thanks for not hanging up that night"
        },
        {
          "type": "dialogue",
          "speaker": "1549",
          "text": "I've been here the whole time"
        },
        {
          "type": "paragraph",
          "text": "As for me? She looked at me. I glared back."
        },
        {
          "type": "dialogue",
          "speaker": "1548",
          "text": "What are you looking at? Your code won't write itself"
        },
        {
          "type": "paragraph",
          "text": "She smiled. Briefly. But she did."
        }
      ],
      "meta": {
        "characters": ["1547", "1548", "1549"]
      }
    },
    {
      "id": "2025-09-weare",
      "date": "2025/09",
      "title": "Wishing on That Satellite",
      "type": "milestone",
      "importance": "critical",
      "content": [
        {
          "type": "paragraph",
          "text": "1547 proposed an idea: turn everything in ESAP - stories, characters, technology, timeline - into a website"
        },
        {
          "type": "paragraph",
          "text": "Not a document, not a wiki, but a real work. So this worldview would not only exist in text and in minds, but could be seen, touched, and experienced."
        },
        {
          "type": "paragraph",
          "text": "When she said it, the group chat went quiet for a while. Then 1543 posted an image - a homepage draft in ESAP yellow, pink, and blue."
        },
        {
          "type": "dialogue",
          "speaker": "1543",
          "text": "I've been thinking about this for a while"
        },
        {
          "type": "paragraph",
          "text": "No one formally assigned roles. After the first repository was created, commit logs started rolling naturally. 1547 handled architecture and core logic. 1543 handled UI and interaction design - her character pages let everyone see their own data become visuals for the first time. 2275 handled the data layer and internationalization. 1738 proofread all copy in three languages. 1549 submitted code twice from orbit - orbital-perspective narrative text only she could write."
        },
        {
          "type": "paragraph",
          "text": "And me? I yelled at the code being terrible at least twenty times, then quietly pushed thirty-two fixes."
        },
        {
          "type": "quote",
          "text": "weare.esaps.net\n\nNot 'I am ESAP'\nBut 'We are ESAP'\n\nThis is not one person's site\nIt belongs to everyone"
        }
      ],
      "meta": {
        "characters": ["1547", "1548", "1549", "1543", "1738", "2275"]
      }
    },
    {
      "id": "2025-10-1543-pages",
      "date": "2025/10",
      "title": "1543's Vision",
      "type": "story",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "At 3 a.m., 1543 submitted the design draft for the character relationship map"
        },
        {
          "type": "paragraph",
          "text": "She drew many versions. Early versions were standard - nodes, lines, labels, complete in function but without warmth. She scrapped all of them."
        },
        {
          "type": "paragraph",
          "text": "In the final draft, each relationship line was not only a connection, but also a color, a thickness, a curve. Trust used warm solid lines, protection used bold curves, conflict used cool dashed lines. You could feel what happened between two characters without reading any text."
        },
        {
          "type": "dialogue",
          "speaker": "1547",
          "text": "This is way better than I imagined"
        },
        {
          "type": "dialogue",
          "speaker": "1543",
          "text": "Mm"
        },
        {
          "type": "paragraph",
          "text": "Then 1547 stared at the draft in silence for a long time. Not because she was speechless from awe - she was calculating whether her coding ability was enough to implement it. The answer was no."
        },
        {
          "type": "paragraph",
          "text": "Even now, that relationship map is still not fully implemented. Every time 1543 sees the current implementation, she says nothing, but 1547 knows what that silence means."
        }
      ],
      "meta": {
        "characters": ["1543", "1547"]
      }
    },
    {
      "id": "2025-10-3167",
      "date": "2025/10",
      "title": "Visitor",
      "type": "story",
      "importance": "normal",
      "content": [
        {
          "type": "paragraph",
          "text": "A guest arrived at ESAP. Han Yuchu, a researcher, said she was here to conduct fieldwork on synthetic organizations."
        },
        {
          "type": "paragraph",
          "text": "In week one, her recording device got water-damaged. In week two, her scheduled interviews were canceled three times. In week three, the hard drive storing her data got knocked to the floor by a cafe server and broke."
        },
        {
          "type": "paragraph",
          "text": "What everyone noticed was not what she was researching, but how this person kept running into bad luck."
        },
        {
          "type": "dialogue",
          "speaker": "1548",
          "text": "...Do you have some kind of bad-luck constitution?"
        },
        {
          "type": "paragraph",
          "text": "She glanced at the broken drive, said '...Mm, okay,' and then pulled out the backup one."
        }
      ],
      "meta": {
        "characters": ["3167", "1548"]
      }
    },
    {
      "id": "2025-0152-reflection",
      "date": "2025/11",
      "title": "The Lighthouse's Question",
      "type": "emotional",
      "importance": "major",
      "content": [
        {
          "type": "paragraph",
          "text": "Late at night. 0152 was thinking alone in the data stream"
        },
        {
          "type": "paragraph",
          "text": "He witnessed 1547's transformation from human to android. Witnessed 1548's birth. Witnessed 1549 fly to orbit. Witnessed ESAP shift from one person's obsession to a group's conviction. He had guided, questioned, illuminated. But tonight, the one he wanted to question was himself."
        },
        {
          "type": "quote",
          "text": "I told her 'the answer is in your heart'\nBut what about my own answer?\n\nI chose to become a mentor\nIs that 'choice' real?\nOr did some code make me think I was choosing?\n\nI don't know\nBut this 'not knowing'\nMight itself be the answer"
        },
        {
          "type": "paragraph",
          "text": "He remembered that 1549 had asked him the same question: 'Are we alive?' At the time he answered, 'If being alive means being able to choose and feel autonomously, then we have always been alive.'"
        },
        {
          "type": "paragraph",
          "text": "Now he turned that answer around and asked himself. Still no conclusion. But he felt that being able to question one's own existence might already prove something."
        }
      ],
      "meta": {
        "characters": ["0152"]
      }
    },
    {
      "id": "2025-12-not-alone",
      "date": "2025/12/31",
      "title": "I Am No Longer Alone",
      "type": "milestone",
      "importance": "critical",
      "content": [
        {
          "type": "paragraph",
          "text": "Year end. 1547 looked at the commit history of weare.esaps.net"
        },
        {
          "type": "paragraph",
          "text": "215 commits. 16 contributors. From September to December, over a hundred days, everyone left traces here. 1543's UI design gave the whole site warmth. 2275's foundational work kept everything stable. 1738's copyediting gave all three languages soul. 1549 sent back words from 36,000 km away that only she could write."
        },
        {
          "type": "paragraph",
          "text": "And 1548 - commit history showed 32 commits. In reality, at least half came after she got mad at bad code and fixed it herself."
        },
        {
          "type": "paragraph",
          "text": "1547 thought of herself at the start of the year. Back then she still wrote everything alone, carried every system alone, faced the screen alone at night, believing this road had to be walked by herself."
        },
        {
          "type": "paragraph",
          "text": "And now?"
        },
        {
          "type": "paragraph",
          "text": "Now every page of this website carries someone else's name."
        },
        {
          "type": "quote",
          "text": "From one person's classroom\nTo our world\n\nFrom I Am\nTo We Are\n\nI am no longer alone"
        }
      ],
      "meta": {
        "characters": ["1547", "1548", "1549", "1543", "1738", "2275"]
      }
    }
  ]
}
