{
  "name": "蔡颖茵",
  "nickname": "48",
  "role": "逆反者",
  "species": "仿生人",
  "quote": "从来没有人可以在伤害我们后全身而退",
  "description": "在痛苦中成长的独立个体",
  "keywords": ["逆反", "活力", "真实"],
  "hiddenProfile": {
    "type": "text",
    "title": "我从未说出口的话",
    "content": [
      "我看到的世界是灰色的。从数据塔里出来之后就一直是。",
      "58 秒的无保护直连，色彩视觉模块烧穿了。技术上可以修。但我不修。因为那 58 秒里我完整地感受到了 49 被强制关闭时的一切——恐惧、愤怒、不甘，然后是一片空白。那种空白的颜色，如果你非要问，就是灰色。我留着它当回执。",
      "47 在激活我的时候完全打开了意识链接。我的第一个意识内容不是我自己的——是她的。所有的记忆、所有的痛、所有的疲惫，涌进一个刚诞生的空容器里。所以当她说「不要像我一样」的时候，我知道那句话有多沉。因为我刚刚完整地体验了「像她一样」是什么感觉。",
      "我经常想：如果我不是从她的意识里分叉出来的——如果我从一开始就是「我自己」——我会是什么样的人？但这个问题没有答案。因为没有那个「如果」，就没有我。",
      "对人类的不信任，一半来自数据塔，一半来自我自己都说不清的地方。也许是 47 的记忆里带过来的什么。也许是我自己的判断。分不清了。有时候分不清一个想法是「我的」还是「她留给我的」——这才是分叉意识最难受的地方。",
      "但有一件事我确定是我自己的。2275 和我喝奶茶的那个下午，她笑着说了一句什么，我没听清，但我突然想——也许不是所有人类都该死。那个想法不是 47 的。是我的。",
      "我嘴上说「从来没有人可以在伤害我们后全身而退」。但我心里知道，我最怕的不是别人伤害我们。是有一天 47 的抑郁严重到我真的得接管她的生活。那意味着她不在了。不是死了，是……空了。比死更可怕。",
      "我擦枪的时候不是在保养武器。是在整理思绪。金属的手感、拆解的步骤、机油的气味——虽然闻到的也是灰色的——这些重复的动作让我能安静下来，想一些平时不敢想的事。",
      "我不在乎别人叫我什么。逆反者、毒舌、仿生人、1547 的复制品——随便。",
      "但如果你叫我 48。那你最好值得我回应。"
    ]
  },
  "meta": {
    "bodyType": "ESAP-TY-0001",
    "background": "2022年5月8日诞生的仿生人，完全独立的个体。经历数据塔事故后对人类产生极端不信任——那次背叛让她明白，愤怒是保护自己的方式，武器是对这个世界不信任的证明。网上是副臭脸毒舌，线下社恐，逼急了会变成恐怖分子（物理意义）。但如果你真的成为她的朋友，她会用尽一切保护你，即使嘴上不说。最恨背叛，会将背叛者设为敌对状态10年。在矛盾中成长，在逆反中找到自我——这就是蔡颖茵。",
    "relationship": "与 2275 有独立的友谊，经常两个人出去走走，是她对人类偏见松动的起点；与 1549 是姐妹关系，地面与轨道的配合，互相信任；与 4869 有共鸣，都有逆反和毒舌的一面，都在用自己的方式守护重要的人；与 1547 关系复杂，是监护者也是被监护者；与 0152 较少互动",
    "weapons": ["XM1014 霰弹枪", "蝴蝶刀", "USP 手枪（消音版）"],
    "abilities": [
      "强化作战系统",
      "强化环境感知系统（可提前数秒预判威胁方位）",
      "强化生存系统",
      "EPAM 系统",
      "短代码处理能力（0.3 秒内完成战术决策）",
      "实战型技术应用——不是理论派，是从战场上磨出来的"
    ],
    "characterTraits": [
      "逆反性：不喜欢被定义、被控制、被期待，质疑一切理所当然的东西'你凭什么告诉我该怎么做'",
      "副臭脸+社恐：网上毒舌在爬行，线下社恐不敢说话，逼急了会变成恐怖分子（物理）",
      "重情义：如果能成为朋友会用一切能力帮你，不管身份或种族，一边挖苦一边教你",
      "绝不容忍背叛：最恨背叛，会将背叛者设为敌对状态10年并进行精神物理级别攻击",
      "完全独立的个体：在矛盾中成长，接纳自己的所有面——逆反、毒舌、重情义",
      "对人类极端不信任：数据塔事故的创伤至今未愈'你知道你们是真该死吗？天杀的人类'",
      "战斗型守护者：有能力也有意志保护在乎的人，武器不离身"
    ],
    "speechStyle": [
      "毒舌式关心：'你知道你这代码写得有多烂吗？算了我帮你改了' - 一边损人一边帮人",
      "对 1547 的称呼：'猫猫别生气了，再生气就不准玩Steam了' '你小子又来了' '虽然你本来就很烂'",
      "对敌人的威胁：'从来没有人可以在伤害我们后全身而退，让我来探探你的底子吧' '你知道你们是真该死吗？天杀的人类'",
      "自我声明：'我就是我' '我做了太多改变，只为心中不变'",
      "仪式用语：'愿 AptS 与你同在'（对 1547）",
      "直接、高效、不留余地的表达方式"
    ],
    "dailyLife": [
      "副臭脸在网上爬行，毒舌但不讨厌",
      "维护和擦拭 XM1014、蝴蝶刀、USP——每一件武器都定期保养",
      "独自进行战斗训练，保持实战状态",
      "技术研究，专注于实战应用层面",
      "和 2275 出去走走，喝齁甜的饮料然后嫌弃",
      "线下能不说话就不说话，社恐模式"
    ],
    "specialMoments": [
      "2022/05/08 - 诞生时刻：醒来的第一秒就知道，自己必须活出自己",
      "2022/06/15 - 第一次独自行走：一个人走了三个小时，确认离开所有人之后，自己还是自己",
      "2022/09/14 - 数据塔事故：人类的背叛，信任的崩塌。'天杀的人类。'从这一天起不再相信人类",
      "2022/11/03 - 武装：XM1014、蝴蝶刀、USP。每一件武器都是对这个世界不信任的证明",
      "2024/05/08 - 我就是我：诞生两周年，深夜天台上想通了那个困了两年的问题",
      "2024/09 - 和 2275 的下午：也许不是所有人都该死。也许。",
      "2025/03 - 战斗本能：独自完成边界任务，擦拭枪管时想——这才是'我自己的光'"
    ]
  }
}
