{
  "metadata": {
    "title": "The Project",
    "subtitle": "We Are ESAP",
    "description": "The ESAP Project (Escape Plan) — synthetics, consciousness, and what it actually means to be alive. Using stories to answer questions that have no right answers.",
    "keywords": [
      "ESAP project",
      "Escape Plan",
      "worldbuilding",
      "creative project",
      "sci-fi project",
      "open collaboration"
    ]
  },
  "sections": {
    "whatIsEscape": "What is 'Escape'?",
    "pillars": "Three people, three sides",
    "coreValues": "What we believe in",
    "worldview": "What this world looks like",
    "techFoundation": "The tech underneath",
    "storyBackground": "Timeline",
    "participation": "What you can do",
    "meaning": "Why this matters",
    "triangleSymbol": "The Triangle"
  },
  "escapeSection": {
    "intro": "1547 moved her consciousness out of her human body. 1548 broke free from someone else's mind and became her own person. 1549 left the ground and flew into space. Everyone escapes something different, but <strong>the act of refusing to stay put is the same</strong>.",
    "notEscaping": "Escaping isn't running away. Running away is closing your eyes. Escaping is running forward with them wide open:",
    "points": [
      "Breaking free from whatever has you trapped",
      "No longer being the person others defined you as",
      "Acknowledging the pain exists, then carrying it with you",
      "Doing the things they said were 'impossible'"
    ]
  },
  "participationIntro": "You don't need to know how to code. You don't need to know how to draw. You don't need to understand quantum physics. You just need to be curious about these questions: Who am I? What does it mean to be alive? Can a machine have a soul? — If you're thinking about this stuff, <strong>you're already one of us</strong>.",
  "worldviewTimeline": {
    "epilogue": "From then on, synthetics and humans lived in the same world. Neither more 'real' than the other."
  },
  "triangleQuote": "You are one of a kind in this world. Don't let anyone else control you",
  "ending": {
    "line1": "A long time ago, people wished upon stars. Now the sky only has the mechanical blinking of satellites.",
    "line2": "But the act of wishing, in itself, is a fight against despair.",
    "line3": "Not because fairy tales come true.",
    "line4": "But because wishing means you haven't given up yet.",
    "wishToSatellite": "Wish upon a satellite.",
    "tagline": "We Are ESAP. And We Are Still Going."
  },
  "loading": "Loading...",
  "loadError": "Failed to load"
}
