{
  "name": "韩予初",
  "nickname": "予初",
  "role": "旁听者",
  "species": "人类",
  "quote": "我只是来看看的",
  "description": "看上去最正常的那个人",
  "keywords": ["冷静", "观察", "应变"],
  "hiddenProfile": {
    "type": "text",
    "title": "从来没交出去的报告",
    "content": [
      "一开始是有目标的。那件事发生之后，我需要一个解释——不是情绪上的，是结构上的。到底是哪个环节出了问题，让馈散技术从实验室流到了不该去的地方。顺着线查，查到了 ESAP。",
      "我以研究者的身份申请了 guest 访问。计划很清楚：三个月，摸清组织结构、技术来源、人员关系，写报告，走人。",
      "第一周，记录设备进水了。第二周，约好的访谈对象临时取消了三次。第三周，存数据的硬盘在咖啡馆被服务员碰到地上摔坏了。",
      "计划 B。后来我不记得是到了哪个字母。可能是 F。",
      "但我注意到一件事：在这里，没有人觉得我的倒霉是值得大惊小怪的。不是同情——是真的不在意。这些人每天处理的事情比硬盘摔坏严重得多。我的运气，在这里连被提起的资格都没有。这反而让我松了一口气。",
      "0152 大概第一天就看出来了。但她什么都没说。后来我问她为什么，她说：'因为你自己会停下来的。'",
      "她说对了。",
      "报告写了一半。写到'组织目的与实际行为一致性评估'那一节的时候，我发现我没法用第三人称了。因为写下来的不是'他们'。是'我们'。",
      "那份报告还在我硬盘里。偶尔打开看看。不是想交出去。是提醒自己，我是怎么从门外走到门里的。",
      "关于倒霉这件事——习惯了。从小就这样。不是大灾大难，就是所有小事都往最不方便的方向走。久了就不生气了。"
    ]
  },
  "meta": {
    "bodyType": "人类",
    "background": "因一起涉及馈散技术外泄的事故而开始独立调查仿生人相关组织，以研究者身份进入 ESAP 担任 guest。原计划三个月内完成调查报告离开，但在观察过程中逐渐改变了立场。倒霉体质贯穿始终——设备损坏、计划失败、各种小意外不断，但她从不抱怨，只是安静地切换到下一个方案。最终留下来不是因为被说服，是因为她自己的数据告诉她：这里的人是真的。现为正式 member，负责信息分析和情报整理。",
    "relationship": "与 0152 有不言明的默契——她从一开始就看穿了她，但选择沉默等待，这份耐心让她始终心存敬意；与 1738 是实际合作最多的搭档，为外部交涉提供数据支持和风险评估；与 2275 相处最自然，她是第一个不带任何目的对她好的人；与 1548 经历了最长的磨合——一个不信人类，一个对仿生人存疑，互相绕了很久才承认对方不是敌人；与 1547 交集不多，但暗中观察她最久，调查时期的习惯",
    "abilities": [
      "数据分析与模式识别",
      "情报整理与交叉验证",
      "风险评估",
      "临场应变——计划永远会失败，所以永远有备选",
      "信息可视化"
    ],
    "characterTraits": [
      "表面正常：团队里最不起眼的人，没有特殊能力，没有戏剧性过去，走在街上不会有人多看一眼",
      "倒霉体质：从小到大所有小事都会往最不方便的方向走，但她处理意外的速度比任何人都快",
      "安静的可靠：不会主动表现，但交给她的事一定会做完，哪怕中途出了七个意外",
      "分析先行：习惯用数据和逻辑处理问题，情绪很少外露，偶尔让人觉得冷淡",
      "慢热：不轻易信任人，但信任一旦建立就非常稳定",
      "不动声色的自嘲：对自己的倒霉有种干燥的幽默感，'……嗯，行吧'是口头禅"
    ],
    "speechStyle": [
      "'……嗯，行吧'——设备坏了、计划失败、咖啡洒了，统一回应",
      "陈述事实为主：'数据显示这条线有问题' '从概率上讲不高'，很少给意见",
      "说话少但准：平时能不开口就不开口，一旦开口说的都是关键信息",
      "偶尔的干燥幽默：'这已经是今天第三杯洒掉的咖啡了'，面无表情",
      "对 0152 会用比较正式的语气，是少数让她主动表示尊重的人",
      "被 1548 毒舌的时候不反驳也不闪躲，就看着她，等她说完"
    ],
    "dailyLife": [
      "整理各种来源的信息，建立分析模型，找别人忽略的关联",
      "东西坏了就修，修完再坏，再修",
      "帮 1738 准备外部交涉需要的数据和背景资料",
      "咖啡是必需品，但总会出点问题——点错、太凉、杯子漏",
      "独自核查数据时最专注，这是她唯一不会倒霉的时候",
      "偶尔被发现在修别人没注意到的小故障，问就是'路过而已'"
    ],
    "specialMoments": [
      "以 guest 身份进入 ESAP——带着调查计划和三个月的期限",
      "第一个月：设备进水、硬盘摔坏、访谈取消——计划 A 到 F 全部报废",
      "0152 的沉默：她什么都知道，但只说了'你自己会停下来的'",
      "报告写到一半：发现写的是'我们'不是'他们'，关掉了文档",
      "正式转为 member——没有仪式，没有宣告，只是某天大家不再叫她'访客'"
    ]
  }
}
